{"title":"articles","values":[[9276,"Productization of Web3: Barriers to enterprise adoption","2023-04-27 12:00:00","https://cointelegraph.com/innovation-circle/productization-of-web3-barriers-to-enterprise-adoption","Web3 has the potential to drive an equitable and decentralized internet. It can also drive exponential business models and unlock new revenue streams for enterprises. While Web3 is gaining adoption and scaling in enterprises, its productization at scale has several barriers. Many enterprises view Web3 as a nuance they must come to terms with, while others view it as innovative and disruptive. Layer-1 blockchains consider it a solution to everything in the world and the media considers it a hype of a lifetime. There is some hype and truth in each perception. Observed reality indicates that enterprise-grade productization has been hard with rudimentary use cases being experimented with and pure Web3 protocols and companies failing to understand the enterprise rhythm. The bottlenecks are attributed more to issues with Web3 which have not made it easy to drive adoption and many have taken the view that Web3 will rip and replace Web2 — a fallacy.  The bigger opportunity for Web3 lies in the enterprises but multiple barriers must be addressed. Interoperability In real life, Web3 is most effective when it becomes domain-specific, use-case-specific or even industry-specific. A generic protocol must have scale (e.g., Ethereum, Polygon, etc.). Without scale, one must have the focus to succeed. It is difficult for layer-1 protocols to overcome the “cold start” problem and drive network effects, especially those that are not EVM (Ethereum Virtual Machine) compatible. These can create more barriers by increasing the cost of developer acquisitions and creating a higher security risk while not offering existing network effects to enterprises. There are also added security risks from bridges between blockchains that should be accounted for. A lack of EVM compatibility could result in higher engineering, product and deployment costs while also impeding scale. Generic protocols have their perils. They are broad enough to not be considered innovative and may not appeal to enterprises looking for specific solutions to their problems. Generic products may not gain adoption or scale, limiting the network effects and value accrued to the protocol — ultimately impeding valuation and growth. The system integrator effect For driving enterprise adoption, systems integrators play a key role in adoption. Systems integration (SI) is a science and requires an understanding of various enterprise systems, the hooks, interfaces and business processes that run their business today. Systems integrator adoption has also provided the scope and scale to the adoption and scale of any new technology (e.g., cloud computing, SaaS-based applications, ERPs, etc.) and blockchain/Web3 is unlikely to deviate from this. System integrators also provide the required network effect on the enterprise side. Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. Apply today Many layer-1 blockchains have commissioned their own SI practices or offer professional services. This creates a competitive posture with the SIs who are a potent channel to resell and drive enterprise adoption. Enterprises typically go to their preferred and trusted SIs due to their knowledge of the environment and would rarely take a chance on a protocol builder implementing their own solution that adds operational risks. Web3 companies must enable the SI ecosystem to enable adoption. They could augment the SI on an as-needed basis like most enterprise software vendors. Operationalization challenges for enterprises Web3 will create value when it solves real enterprise problems and is not stuck in the proof-of-concept sandboxes or lab environments. This transition from sandbox to production varies from weeks to even years depending on the enterprise, the use cases, budgets and priorities. The majority of the time, the inability to migrate from sandboxes to live environments is caused by the lack of integrations and connectors to existing Web2 systems. Layer-1 protocols are raw. It is like offering TCP/IP to an enterprise and asking them to build the internet. One must make this easy for them. Operationalizing Web3 products is not smooth due to a lack of clearly defined endpoints, missing integrations, L1 protocols seeking gas fees to be paid in their native tokens (enterprises must sign up to have crypto on their balance sheets), lack of APIs and lack of in-house talent. A lack of these components creates a lot of friction and costs for enterprises to boot up real-time use cases and an inability to justify a clear ROI. Talent issues There is an acute shortage of quality and quantity of Web3 developers, according to Electric Capital’s report, there are only 23,343 monthly developers in Web3 as of December 2022. The imbalance between business builders, deep engineers, dApp creators, product managers and UX professionals must be balanced and hit a critical mass before Web3 can be productized at scale. Mathematicians and cryptographers do not necessarily make good Web3 engineers. Good Web3 engineers are not necessarily good product managers who are able to commercialize complex Web3 products. Many Web3 founders have not sold and delivered to the enterprise and hence entail a steep learning curve on how to position the protocol, use product management as a discipline, understand network effects, create a scalable sales engine for the enterprise customers or do effective marketing. A migration of Web2 developers to Web3 or creator tools that help people straddle both worlds will help set the stage for mass adoption. Concluding thoughts Web3 has gained significant adoption across several sectors within enterprises. The momentum is stronger and adoption appears to center on well-defined use cases regarding layer-1 blockchain protocols. Enterprises must remember security and network effects and consider EVM-compatible chains. They can embrace low-code and/or no-code platforms with connectors to reduce dependencies on complex programming languages and shortage of talent. Until regulatory clarity comes into play, enterprises are unlikely to pay gas fees by procuring cryptocurrencies and will prefer payment in fiat currencies and are likely to adopt protocols that integrate with existing systems. When Web3 focuses on working with Web2, we are more likely to see accelerated adoption. Companies that are focused on adoption instead of replacing Web2 are the future. Nitin Kumar is a growth CEO and co-founder at zblocks. He is a recognized leader, author, former consulting partner and VC investor.      This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph. Learn more about Cointelegraph Innovation Circle and see if you qualify to join","<div class=\"post-content\" data-v-2ab31f4e><p>Web3 has the potential to drive an equitable and decentralized internet. It can also drive exponential business models and unlock new revenue streams for enterprises. While Web3 is gaining adoption and scaling in enterprises, its productization at scale has several barriers. Many enterprises view Web3 as a nuance they must come to terms with, while others view it as innovative and disruptive. Layer-1 blockchains consider it a solution to everything in the world and the media considers it a hype of a lifetime.</p> <p>There is some hype and truth in each perception. Observed reality indicates that enterprise-grade productization has been hard with rudimentary use cases being experimented with and pure Web3 protocols and companies failing to understand the enterprise rhythm. The bottlenecks are attributed more to issues with Web3 which have not made it easy to drive adoption and many have taken the view that Web3 will rip and replace Web2 — a fallacy. </p> <p>The bigger opportunity for Web3 lies in the enterprises but multiple barriers must be addressed.</p> <h3>Interoperability</h3> <p>In real life, Web3 is most effective when it becomes domain-specific, use-case-specific or even industry-specific. A generic protocol must have scale (e.g., Ethereum, Polygon, etc.). Without scale, one must have the focus to succeed. It is difficult for layer-1 protocols to overcome the “cold start” problem and drive network effects, especially those that are not EVM (Ethereum Virtual Machine) compatible.</p> <p>These can create more barriers by increasing the cost of developer acquisitions and creating a higher security risk while not offering existing network effects to enterprises. There are also added security risks from bridges between blockchains that should be accounted for. A lack of EVM compatibility could result in higher engineering, product and deployment costs while also impeding scale.</p> <p>Generic protocols have their perils. They are broad enough to not be considered innovative and may not appeal to enterprises looking for specific solutions to their problems. Generic products may not gain adoption or scale, limiting the network effects and value accrued to the protocol — ultimately impeding valuation and growth.</p> <h3>The system integrator effect</h3> <p>For driving enterprise adoption, systems integrators play a key role in adoption. Systems integration (SI) is a science and requires an understanding of various enterprise systems, the hooks, interfaces and business processes that run their business today. Systems integrator adoption has also provided the scope and scale to the adoption and scale of any new technology (e.g., cloud computing, SaaS-based applications, ERPs, etc.) and blockchain/Web3 is unlikely to deviate from this. System integrators also provide the required network effect on the enterprise side.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&amp;_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>Many layer-1 blockchains have commissioned their own SI practices or offer professional services. This creates a competitive posture with the SIs who are a potent channel to resell and drive enterprise adoption. Enterprises typically go to their preferred and trusted SIs due to their knowledge of the environment and would rarely take a chance on a protocol builder implementing their own solution that adds operational risks. Web3 companies must enable the SI ecosystem to enable adoption. They could augment the SI on an as-needed basis like most enterprise software vendors.</p> <h3>Operationalization challenges for enterprises</h3> <p>Web3 will create value when it solves real enterprise problems and is not stuck in the proof-of-concept sandboxes or lab environments. This transition from sandbox to production varies from weeks to even years depending on the enterprise, the use cases, budgets and priorities. The majority of the time, the inability to migrate from sandboxes to live environments is caused by the lack of integrations and connectors to existing Web2 systems.</p> <p>Layer-1 protocols are raw. It is like offering TCP/IP to an enterprise and asking them to build the internet. One must make this easy for them. Operationalizing Web3 products is not smooth due to a lack of clearly defined endpoints, missing integrations, L1 protocols seeking gas fees to be paid in their native tokens (enterprises must sign up to have crypto on their balance sheets), lack of APIs and lack of in-house talent. A lack of these components creates a lot of friction and costs for enterprises to boot up real-time use cases and an inability to justify a clear ROI.</p> <h3>Talent issues</h3> <p>There is an acute shortage of quality and quantity of Web3 developers, according to <a href=\"https://www.prnewswire.com/news-releases/electric-capital-releases-2022-crypto-developer-report-301723401.html\">Electric Capital’s report</a>, there are only 23,343 monthly developers in Web3 as of December 2022. The imbalance between business builders, deep engineers, dApp creators, product managers and UX professionals must be balanced and hit a critical mass before Web3 can be productized at scale.</p> <p>Mathematicians and cryptographers do not necessarily make good Web3 engineers. Good Web3 engineers are not necessarily good product managers who are able to commercialize complex Web3 products. Many Web3 founders have not sold and delivered to the enterprise and hence entail a steep learning curve on how to position the protocol, use product management as a discipline, understand network effects, create a scalable sales engine for the enterprise customers or do effective marketing. A migration of Web2 developers to Web3 or creator tools that help people straddle both worlds will help set the stage for mass adoption.</p> <h3>Concluding thoughts</h3> <p>Web3 has gained significant adoption across several sectors within enterprises. The momentum is stronger and adoption appears to center on well-defined use cases regarding layer-1 blockchain protocols. Enterprises must remember security and network effects and consider EVM-compatible chains. They can embrace low-code and/or no-code platforms with connectors to reduce dependencies on complex programming languages and shortage of talent.</p> <p>Until regulatory clarity comes into play, enterprises are unlikely to pay gas fees by procuring cryptocurrencies and will prefer payment in fiat currencies and are likely to adopt protocols that integrate with existing systems. When Web3 focuses on working with Web2, we are more likely to see accelerated adoption. Companies that are focused on adoption instead of replacing Web2 are the future.</p> <p><em>Nitin Kumar is a growth CEO and co-founder at <a href=\"https://www.zblocks.io/\">zblocks</a>. He is a recognized leader, author, former consulting partner and VC investor.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\"> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>Web3、分散型インターネットを実現へ\n\nWeb3は、公平で分散型のインターネットを実現する可能性を持っている。また、企業にとって指数関数的なビジネスモデルの推進や新たな収益源の開放にもつながる。Web3が企業での採用や拡大が進む一方で、大規模な製品化にはいくつかの障壁が存在している。多くの企業はWeb3を受け入れなければならない厄介なものと捉えているが、一部は革新的で破壊的であると見ている。第1層のブロックチェーン（Layer-1 blockchains）はそれを世界のあらゆる問題の解決策と考えており、メディアは一世を風靡するものとして報じている。\n\n【Web3が分散型インターネット実現への鍵、しかしその大規模製品化には障壁も】</p> <p>エンタープライズ向け製品化が困難で、基本的なユースケースが試験的に実装され、純粋なWeb3プロトコルと企業がエンタープライズのリズムを理解できないという現実が観察されている。ボトルネックは、Web3が普及促進を容易にするのではなく、Web3がWeb2を置き換えるという誤解が原因であるとされている。</p> <p>Web3の大きな機会、企業にあり - ただし、いくつかの障壁に対処が必要\n\nWeb3とは、インターネットの次世代技術を指す言葉である。Web3には企業向けの大きな機会があるが、重要な障壁が複数存在しており、それらに対処する必要がある。</p> <h3>相互運用性、あるいは相互接続性は、異なるシステムやデバイスが共通の基準に従って互いにやり取りし、協力して機能することを指す。\n\nElon Musk suggests government regulation on cryptocurrencies should not pick winners and losers\n\nThe Tesla and SpaceX CEO, Elon Musk, said in a tweet on Feb. 21 that government regulation of cryptocurrencies should not favor one coin over another. Musk's comments come after a recent decision by the U.S. Federal Reserve to restrict access to stablecoins by financial institutions.\n\nステーブルコインとは、価値の変動が小さい仮想通貨である。これに対してハイパーボライアル通貨（急速な価格変動が特徴）がある。\n\nイーロン・マスク氏は仮想通貨に対する政府規制が特定のコインを優遇してはならないとツイート\n\nテスラとスペースXのCEOであるイーロン・マスク氏は2月21日のツイートで、仮想通貨に対する政府規制は何らかのコインを他よりも優遇するべきではないとのべた。「政府規制は勝者や敗者を選ばないべきだ」と彼はツイッターで語っている。この発言は、米連邦準備制度が金融機関によるステーブルコインへのアクセスを制限するという最近の決定を受けたものである。\n\n【まとめ】\nイーロン・マスク氏、仮想通貨規制は特定のコインを優遇すべきでないと主張</h3> <p>実際のところ、Web3はドメイン固有、ユースケース固有、または業界固有になったときに最も効果的である。汎用プロトコルはスケールを持たなければならない(例：イーサリウム、ポリゴンなど)。スケールがない場合、成功するために焦点を絞る必要がある。特にEVM(イーサリウム仮想マシン)互換でないものについては、レイヤー1プロトコルが「コールドスタート」の問題を克服し、ネットワーク効果を促進することは困難だ。\n\n【実際にはWeb3はドメイン固有などで最も効果的、汎用プロトコルはスケール必須】</p> <p>開発者の取得コスト増加やセキュリティリスクの高まりにより、障壁が増加する可能性がある。また、既存のネットワーク効果も企業に提供しない。さらに、ブロックチェーン間のブリッジからのセキュリティリスクも考慮されるべきである。EVM（イーサリアム・バーチャル・マシン）互換性の欠如は、エンジニアリング、製品、展開コストの増加やスケールの妨げにもつながる可能性がある。\n\n要約: 開発者取得コスト増加やセキュリティリスクにより障壁が増加、EVM互換性欠如がコスト上昇やスケーリング障害につながる可能性</p> <p>汎用プロトコルの危険性\n汎用プロトコルには、その危険性がある。それらは革新的と見なされるほどの幅広さがなく、企業が抱える問題に対する具体的な解決策を求める際に魅力を感じないかもしれない。汎用製品は、採用やスケールが促進されず、プロトコルに蓄積されるネットワーク効果や価値が制限されることになる。これは、最終的に評価や成長を阻害する要因となる。\n\n汎用プロトコルとは、特定の問題に対処するために設計されたものではなく、多くの異なるアプリケーションや状況で使用することができるプロトコルである。しかし、その幅広さゆえに革新性が乏しく、企業が直面する固有の問題に対応するためのソリューションとしては魅力を感じないことがある。このため、汎用製品は十分な採用やスケールが得られず、プロトコルがもたらすネットワーク効果や価値が制限され、最終的に評価や成長が阻害される可能性がある。\n\n【要約】\n汎用プロトコルの危険性とは、革新的でなく、企業が抱える問題に対する具体的な解決策として魅力を感じられないことで、採用やスケールが促進されず、ネットワーク効果や価値が制限されること。これにより、最終的に評価や成長が阻害される恐れがある。</p> <h3>システムインテグレータ効果、企業のITシステム効率化に貢献\n\nシステムインテグレータは、企業のITシステムを効率化するために活躍する専門家のことである。彼らはビジネスプロセス改善、技術インフラの構築、アプリケーション開発などの領域で専門的な知識と技術を持っている。システムインテグレータの目的は、異なる技術やシステムを統合し、シームレスで効率的な環境を作り出すことである。これにより、企業はコスト削減や競争力向上、顧客満足度の向上など、多くの利益を得ることができる。\n\n多様な技術やシステムを問題なく統合するためには、ハードウェア・ソフトウェアの設計や構築、運用・保守などの一連のプロセスを理解しなければならない。そのため、システムインテグレータはプロジェクトマネージメントや要件定義、設計、実装、テスト、運用・保守、技術文書作成など、幅広いスキルセットが求められる。\n\nシステムインテグレータの活躍が企業にもたらす効果は多岐にわたる。まず、効率的なITシステムを構築することで、業務プロセスが改善され、時間やコストの削減が図られる。また、継続的なシステムの改善により、競争力が向上し、新たなビジネスチャンスが生まれることもある。さらに、顧客満足度が向上し、ブランドイメージを強化することができる。\n\nしかし、システムインテグレータには潜在的なリスクもある。例えば、プロジェクトのコストオーバーランやスケジュール遅延、技術的な問題の未解決などが挙げられる。これらのリスクを回避するため、プロジェクトの進行状況を適切に管理し、チームメンバーと密接なコミュニケーションをとることが重要である。\n\n今後も企業がITシステムを効率化するためにシステムインテグレータが求められるだろう。適切なプロジェクト管理とリスク回避策を踏まえ、システムインテグレータは企業の成長に貢献しうる存在である。\n\n【システムインテグレータ 効果、企業のITシステム効率化に貢献】</h3> <p>企業の採用促進において、システムインテグレータが重要な役割を果たす。システムインテグレーション（SI）は科学であり、企業のシステムやフック、インターフェイス、ビジネスプロセスの理解が求められる。また、システムインテグレータの採用は、新技術（例：クラウドコンピューティング、SaaSベースのアプリケーション、ERP等）の採用と規模拡大にも影響を与え、ブロックチェーンやWeb3も例外ではないだろう。システムインテグレータは、企業側で必要とされるネットワーク効果も提供する。\n\nシステムインテグレータ、企業採用における鍵となる役割\nシステムインテグレータは新技術の採用や規模拡大に重要な役割を持ち、クラウドコンピューティングやSaaSベースのアプリケーション、ERPなどの分野で影響力を発揮している。また、企業側で必要とされるネットワーク効果も提供している。</p> <p>未来を変革するコミュニティへ参加しよう\nコインテレグラフ・イノベーションサークルは、ブロックチェーン技術のリーダーたちが集まり、つながり、協力し、情報発信する場である。今日から参加を申し込もう。</p> <p>レイヤー1ブロックチェーンがSI業務を委託、専門サービスを提供へ\n\n数多くのレイヤー1ブロックチェーンは、独自のSI（システムインテグレーション）業務を委託したり、専門サービスを提供している。これにより、SIがエンタープライズの採用を促進する強力なチャネルと競合する姿勢が生まれている。企業は通常、環境に関する知識が豊富な信頼されたSIに依頼し、プロトコルビルダーが独自のソリューションを実装することで運用リスクが増大する場合には、ほとんどチャンスを与えない。Web3企業は、SIエコシステムを活用し、採用促進に役立てる必要がある。彼らは、ほとんどのエンタープライズソフトウェアベンダーと同様に、必要に応じてSIを強化できる。\n\n【レイヤー1ブロックチェーン、独自のSI業務を委託・専門サービス提供へ】\n企業は信頼されているSIを通じて仮想通貨の導入を進めるが、Web3企業はSIエコシステムを活用し、採用促進に役立てる必要がある。</p> <h3>企業における運用化への課題\n\n企業は、新しい技術や戦略を取り入れる際、運用化への課題に直面することがよくある。運用化とは、新しい技術や戦略を組織の業務プロセスに適応させ、効果的に活用することである。主な課題には、技術的な問題、組織文化、リーダーシップ、資源、およびトレーニングの不足が挙げられる。\n\n技術的な問題は、新しい技術の導入や既存のシステムへの統合が難しい場合に生じる。組織文化の課題は、変更に対する抵抗や新しいアプローチへの適応が困難であることだ。リーダーシップの課題は、適切な戦略やビジョンを持っているかどうか、また変更をサポートするために十分な権限を持っているかどうかに関連する。資源の課題は、適切な資金や人材を確保することが難しい場合である。トレーニングの不足は、従業員が新しい技術や方法を学ぶための時間やリソースが不足している場合に発生する。\n\n企業がこれらの課題に対処するためには、適切な計画と戦略が重要である。また、組織全体の文化やリーダーシップの変革が必要となることもある。運用化への課題を克服することで、企業は新しい技術や戦略を効率的に活用し、競争力を向上させることができる。\n\n企業における運用化への課題：技術的問題・組織文化・リーダーシップ・資源・トレーニングの不足</h3> <p>ウェブ3は、実際の企業の問題を解決し、プルーフ・オブ・コンセプトのサンドボックスや実験環境にとどまらないことで価値を生み出す\n\nウェブ3が価値を生み出すのは、実際の企業の問題を解決し、プルーフ・オブ・コンセプト（PoC:技術やアイデアの実現可能性を確かめる試作品）のサンドボックスや実験環境にとどまらず、実際の運用環境に移行した時だ。この移行期間は、企業やユースケース、予算や優先順位によって、数週間から数年に及ぶこともある。サンドボックスから実運用環境への移行ができない主な原因は、既存のウェブ2システムへのインテグレーションやコネクタが不足しているためだ。\n\nウェブ3、実用化への課題は既存システムとの連携</p> <p>レイヤー1プロトコルは未加工で、企業にTCP/IPを提供し、インターネットを構築するよう求めるのと同じである。これを企業にとって容易にする必要がある。Web3プロダクトの運用は、明確に定義されたエンドポイントが欠けているため、統合が不足しているため、L1プロトコルがネイティブトークンでのガス料を求めているため（企業はバランスシートに暗号資産を持つ必要がある）、APIが不足しており、社内の専門家も不足しているためにスムーズではない。これらの要素が欠けていることで、企業がリアルタイムのユースケースを立ち上げる際に摩擦やコストがかかり、明確なROIを正当化することができなくなる。\n\nタイトル：レイヤー1プロトコルの課題、企業にとってハードルが高い\n\nレイヤー1プロトコルは未加工で、企業にとって利用しづらい状況がある。明確に定義されたエンドポイントや統合が欠けており、ガス料支払いのためにネイティブトークンを求めるL1プロトコルなど、さまざまな要因からWeb3プロダクトの運用がスムーズではない。このため、企業はリアルタイムのユースケースを始める際に摩擦やコストがかかり、明確なROIを正当化することが難しくなっている。</p> <h3>人材問題\n\nCrypto investor and billionaire Mike Novogratz, who is the CEO of Galaxy Digital, a well-known cryptocurrency investment firm, remains bullish on Bitcoin, reiterating his view that the crypto asset could hit US$500,000 by the end of 2024. On Twitter, Novogratz wrote, \"I remain a big believer in crypto, and I think Bitcoin is going much higher.\"\n\nNovogratz believes that the current correction in the crypto market is a result of a massive talent shortage in the space. He argues that the current talent pool is inadequate to handle the growing demand for crypto-related services and products, which is ultimately causing a slowdown in the market. \n\nThis is not the first time that Novogratz has expressed his bullish views on the crypto market. In an interview earlier this year, he stated that it was only a matter of time before Bitcoin reaches the US$500,000 mark, citing the increasing institutional demand for the asset. With the current dip in prices, Novogratz's prediction might entice new investors to join the market, hoping to capitalize on the potential surge in Bitcoin's value.\n\n仮想通貨投資家にして億万長者のマイク・ノヴォグラッツ氏は、有名な仮想通貨投資企業であるギャラクシー・デジタルのCEOである。彼はビットコインに強気の姿勢を続けており、2024年末までにビットコインが50万ドル（約6000万円）に達する可能性があるとの見解を再度述べている。ノヴォグラッツ氏はツイッターで「暗号資産への信念は変わらず、ビットコインはさらに高くなると思う」と書いている。\n\n彼は、現在の仮想通貨市場の修正は、業界内での大規模な人材不足が原因であると考えている。市場での需要の増加に対処できるだけの十分な人材が不足しており、この結果として市場が減速していると言っている。\n\nノヴォグラッツ氏が仮想通貨市場に強気の意見を述べるのはこれが初めてではない。今年初めのインタビューで、ビットコインが50万ドルに達するのは時間の問題であり、資産に対する機関投資家の需要の増加を指摘していた。現在の価格低下を受けて、彼の予測は新たな投資家を市場に引き込むかもしれず、ビットコインの価値の急上昇を期待して参入することがあるだろう。</h3> <p>ウェブ3開発者の質・量に深刻な不足、ビジネス構築者とエンジニアの不均衡解消が急務\n\nElectric Capitalの報告によれば、ウェブ3とはインターネットの次世代プラットフォームのことだが、2022年12月時点でウェブ3の開発者は月間23,343名しかいないという。ウェブ3が大規模に商品化される前に、ビジネス構築者、深いエンジニアリングができるエンジニア、dApp（分散型アプリケーション）の開発者、製品管理者、UX専門家の不均衡を解消し、臨界人口に達しなければならない。ウェブ3とは、インターネットをデータベース化し、分散型の新しいインターネット環境を構築することを目指す次世代のインターネットプラットフォームである。\n\ndAppは、分散型アプリケーションのことで、中央集権型ではなく分散型のコンピュータネットワーク上で実行されるアプリケーションのことだ。\n\nウェブ3開発者の質・量に深刻な不足、ビジネス構築者とエンジニアの不均衡解消が急務</p> <p>数学者や暗号学者が必ずしも優れたWeb3エンジニアになるわけではない。優れたWeb3エンジニアであっても、複雑なWeb3製品を商品化できるプロダクトマネージャーには必ずしもならない。多くのWeb3創設者は、エンタープライズに販売・提供する経験がなく、プロトコルの位置付けやプロダクトマネジメントを活用した分野など、急速な学習曲線を経験する。Web2開発者からWeb3への移行や、両方の世界を横断する人々を支援するクリエイターツールが普及に向けたステージを整える。\n\nタイトル：Web3エンジニアとプロダクトマネージャーの役割、一致しないケースも\n\nWeb3エンジニアである数学者や暗号学者が、必ずしも複雑なWeb3製品の商品化に長けたプロダクトマネージャーにはならないことが指摘されている。Web2からWeb3への移行を促進し、大規模な普及のためのステージを整えることが求められている。</p> <h3>結論的な考察</h3> <p>Web3、企業内分野での採用が拡大－レイヤー1ブロックチェーンが主要なユースケース\n\nWeb3は、企業内のいくつかの分野で大幅な採用が広まっている。勢いは強く、レイヤー1ブロックチェーンプロトコルに関する明確なユースケースを中心に採用が進んでいる。企業はセキュリティとネットワーク効果を念頭に置き、EVM互換チェーンを検討するべきである。彼らは、複雑なプログラミング言語や人材不足に依存しないよう、コネクタを備えたローコードあるいはノーコードプラットフォームを活用できる。\n\n【Web3とは、分散型ウェブ技術によって構築された次世代のインターネット環境のことである。】</p> <p>企業が仮想通貨を調達してガス手数料を支払うのは、規制の明確化が進むまで難しいだろう。法定通貨での支払いや既存システムと連携するプロトコルの採用が好まれる傾向にある。Web3がWeb2と連携することに注力すると、採用が加速する可能性が高まる。将来の企業は、Web2を置き換えるのではなく、採用に重点を置く企業が主流となるだろう。</p> <p>ニティン・クマール氏、zblocksで成長CEO兼共同創設者に\n\nニティン・クマール氏は、zblocksの成長を担当するCEO兼共同創設者である。彼は、リーダー、著者、元コンサルティングパートナー、VC投資家として認知されている。</p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\"/> </div> </div> <p>仮想通貨業界のリーダーが集まる「コインテレグラフ・イノベーションサークル」\n\nコインテレグラフ・イノベーションサークルは、ブロックチェーン技術業界の経験豊富な幹部たちや専門家たちが集まった組織である。彼らは連携や協力、そして先導的な考え方を通して未来を築いている。本記事は、そのコインテレグラフ・イノベーションサークルを通じて発表されたものである。ただし、ここで述べられている意見は、必ずしもコインテレグラフのものとは限らない。</p> <p>コインテレグラフ・イノベーション・サークルについて詳しく知り、参加資格があるか確認しよう</p></div>","Cointelegraph","Web3の製品化：企業導入への障壁\n\nWeb3は、従来のインターネット(Web2)から分散型のインターネットへの移行を目指す技術である。企業導入を促すための製品化が進められているが、いくつかの課題が立ちはだかっている。Web2は中央集権型で情報を扱うインターネットであるのに対し、Web3は分散型技術を用いてプライバシーとデータ主権を重視したインターネット環境を提供するものだ。\n\nWeb3の導入には、技術的な障壁や企業運用への懸念がある。技術的な障壁としては、スケーラビリティやプライバシー保護の問題が挙げられる。また、企業運用への懸念としては、既存システムとの互換性やセキュリティ・リスク管理が問題となっている。これらの課題を解決するために、関係者はさまざまな取り組みを行っている。\n\n例えば、国際規格化を進めることで、Web3技術の普及と企業への導入を促す動きがある。また、スケーラビリティやプライバシー保護の問題を解決するため、新たなプロトコルや開発プラットフォームが開発されている。さらに、企業運用への影響を抑えるために、慎重にシステム移行を計画し、セキュリティ・リスク管理を徹底する方法が検討されている。\n\nWeb3技術の製品化と企業導入が進むことで、分散型インターネットの利点を享受できるようになるだろう。しかし、その道のりは容易ではなく、関係者が一丸となって課題に取り組む必要がある。\n\nタイトル：Web3の製品化による企業導入、技術的障壁と運用懸念が課題"]],"fields":["id","title","pubDate","link","text","html","content_translated","source","title_translated"],"types":[23,1043,1114,1043,25,25,25,1043,1043],"type_names":["integer","text","timestamp without time zone","text","text","text","text","text","text"],"started_at":"2023-04-27 03:44:43 +0000","finished_at":"2023-04-27 03:44:43 +0000","checksum":"b01be50538fbdc537e755d12247e207e"}