{"title":"articles","values":[[2953,"The future of enterprise blockchain is multi-chain","2023-04-11 14:00:00","https://cointelegraph.com/innovation-circle/the-future-of-enterprise-blockchain-is-multi-chain","Blockchain interoperability — the interconnecting of multiple networks to allow data and value to flow seamlessly — is often envisioned in the context of consumer applications. Think DEXs adding support for numerous EVM networks, or blockchain bridges linking to the next trendy DeFi ecosystem. But interoperability has far broader ramifications than allowing traders to jump chains on a whim. In fact, one of the greatest beneficiaries of the maturation of multi-chain interoperability will be enterprises. As enterprise solutions grow across industries, the need to engage with multiple chains rather than exist on a single, isolated blockchain is increasing.  The advantages of connecting to a fully interoperable blockchain ecosystem are many, supporting future-proof solutions that make it easy to migrate from one platform to another while compounding the network effects of a shared business landscape to expand capacity, accessibility and choice for network participants. What enterprises want In the past five years, enterprises of all kinds have found use cases for blockchain, ranging from supply chain management to healthcare. While the applications are as diverse as the businesses themselves, their demands are broadly similar. Enterprises using blockchain are essentially doing so in pursuit of greater trust, security, transparency and data traceability. If a blockchain can deliver these qualities in greater measure than a legacy system, adding Web3 benefits to existing solutions is a no-brainer.  Blockchain’s ability to securely automate processes that previously required massive manpower, physical infrastructure and multiple intermediaries means that enterprises can achieve massive boosts to operational efficiency while drastically reducing costs. However, expecting every vendor and supplier to use the same chain as a single organization significantly hinders the likelihood of mass adoption — especially when supplier networks are large and complex. Cross-chain cooperation The options for blockchain protocols have increased significantly over the past few years for both private and public chains. Each blockchain comes with its own unique benefits and drawbacks, meaning any enterprise that limits itself to one chain fails to capitalize on the full potential of benefits different blockchain technologies might offer. For instance, private blockchains are well-suited for protecting intellectual property but are limited by their permissioned nature. Conversely, public chains enable global access and more data points, but users are at the mercy of other entities, which can lead to erratic network costs and bottlenecks. Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. Apply today The simplest way to envision this is as a series of roads. A factory in the middle of the desert isn’t going to do much business until it’s connected to public highways. It might be able to work wholesale with neighboring manufacturers, but local roads will only carry it so far. Only when it’s connected to the interstate can it start to ship globally. Multi-chain matters Enterprises seeking to make use of blockchain aren’t short of options. Public and private solutions such as Quorum, Hyperledger Fabric, Polygon and Ethereum are all readily available and proven (Simba Chain does have an affiliation with both the Hyperledger Foundation and Polygon). However, interoperability between blockchains is essentially non-existent. If a blockchain solution can’t effectively share legacy data or connect with existing on-chain data infrastructure, its value proposition is seriously impaired.  One of the biggest impediments to greater interoperability is the absence of a shared programming language between blockchains. This increases the cost and complexity of creating multi-chain applications. An interoperable future Although multi-chain solutions can play a vital role in eliminating barriers to cross-chain functionality, they can’t unilaterally deliver full interoperability. Solving this broader problem calls for efforts from a cross-section of companies operating within the blockchain ecosystem, from the base layer to the application layer. For the past two years, countless dollars and hours have been put into this challenge and the results are starting to appear. Blockchain bridges are flourishing and are being used for much more than moving tokens. Cross-chain messaging is now routinely being used to trigger smart contracts, query data from third-party applications and resolve events that were initiated on different chains. Meanwhile, multi-chain applications are being developed that remain unbeholden to any one ecosystem, instead taking their liquidity or data from whichever chain supplies it at the best rate. Because of these innovations, it no longer takes a 100-member developer team to create applications that leverage multi-chain environments. As a result, small to medium-sized enterprises, large corporations and government institutions can tap into this powerful functionality. Given the diversity of global business, it’s inevitable that enterprises will emerge with blockchain solutions that exist across dozens of private and public chains. It’s equally likely that solutions will emerge that allow these siloed systems to work as one, enabling businesses to create powerful blockchain solutions that aren’t constrained by networks or languages. In short, the future of enterprise blockchain is intertwined with interoperability — and it’s closer than you think. Bryan Ritchie is CEO of SIMBA Chain, the leading API development platform to help companies transition from Web2 to Web3.       This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph. Learn more about Cointelegraph Innovation Circle and see if you qualify to join","<div class=\"post-content\" data-v-2ab31f4e><p>Blockchain interoperability — the interconnecting of multiple networks to allow data and value to flow seamlessly — is often envisioned in the context of consumer applications. Think DEXs adding support for numerous EVM networks, or blockchain bridges linking to the next trendy DeFi ecosystem.</p> <p>But interoperability has far broader ramifications than allowing traders to jump chains on a whim. In fact, one of the greatest beneficiaries of the maturation of multi-chain interoperability will be enterprises. As enterprise solutions grow across industries, the need to engage with multiple chains rather than exist on a single, isolated blockchain is increasing. </p> <p>The advantages of connecting to a fully interoperable blockchain ecosystem are many, supporting future-proof solutions that make it easy to migrate from one platform to another while compounding the network effects of a shared business landscape to expand capacity, accessibility and choice for network participants.</p> <h3>What enterprises want</h3> <p>In the past five years, enterprises of all kinds have found use cases for blockchain, ranging from supply chain management to healthcare. While the applications are as diverse as the businesses themselves, their demands are broadly similar. Enterprises using blockchain are essentially doing so in pursuit of greater trust, security, transparency and data traceability. If a blockchain can deliver these qualities in greater measure than a legacy system, adding Web3 benefits to existing solutions is a no-brainer. </p> <p>Blockchain’s ability to securely automate processes that previously required massive manpower, physical infrastructure and multiple intermediaries means that enterprises can achieve massive boosts to operational efficiency while drastically reducing costs. However, expecting every vendor and supplier to use the same chain as a single organization significantly hinders the likelihood of mass adoption — especially when supplier networks are large and complex.</p> <h3>Cross-chain cooperation</h3> <p>The options for blockchain protocols have increased significantly over the past few years for both private and public chains. Each <a href=\"https://www.investopedia.com/news/public-private-permissioned-blockchains-compared/\">blockchain</a> comes with its own unique benefits and drawbacks, meaning any enterprise that limits itself to one chain fails to capitalize on the full potential of benefits different blockchain technologies might offer.</p> <p>For instance, private blockchains are well-suited for protecting intellectual property but are limited by their permissioned nature. Conversely, public chains enable global access and more data points, but users are at the mercy of other entities, which can lead to erratic network costs and bottlenecks.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&amp;_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>The simplest way to envision this is as a series of roads. A factory in the middle of the desert isn’t going to do much business until it’s connected to public highways. It might be able to work wholesale with neighboring manufacturers, but local roads will only carry it so far. Only when it’s connected to the interstate can it start to ship globally.</p> <h3>Multi-chain matters</h3> <p>Enterprises seeking to make use of blockchain aren’t short of options. Public and private solutions such as Quorum, Hyperledger Fabric, Polygon and Ethereum are all readily available and proven (Simba Chain does have an affiliation with both the Hyperledger Foundation and Polygon). However, interoperability between blockchains is essentially non-existent. If a blockchain solution can’t effectively share legacy data or connect with existing on-chain data infrastructure, its value proposition is seriously impaired. </p> <p>One of the biggest impediments to greater interoperability is the absence of a shared programming language between blockchains. This increases the cost and complexity of creating multi-chain applications.</p> <h3>An interoperable future</h3> <p>Although multi-chain solutions can play a vital role in eliminating barriers to cross-chain functionality, they can’t unilaterally deliver full interoperability. Solving this broader problem calls for efforts from a cross-section of companies operating within the blockchain ecosystem, from the base layer to the application layer. For the past two years, countless dollars and hours have been put into this challenge and the results are starting to appear.</p> <p>Blockchain bridges are flourishing and are being <a href=\"https://www.cbinsights.com/research/industries-disrupted-blockchain/\">used</a> for much more than moving tokens. Cross-chain messaging is now routinely being used to trigger smart contracts, query data from third-party applications and resolve events that were initiated on different chains.</p> <p>Meanwhile, multi-chain applications are being developed that remain unbeholden to any one ecosystem, instead taking their liquidity or data from whichever chain supplies it at the best rate. Because of these innovations, it no longer takes a 100-member developer team to create applications that leverage multi-chain environments. As a result, small to medium-sized enterprises, large corporations and government institutions can tap into this powerful functionality.</p> <p>Given the diversity of global business, it’s inevitable that enterprises will emerge with blockchain solutions that exist across dozens of private and public chains. It’s equally likely that solutions will emerge that allow these siloed systems to work as one, enabling businesses to create powerful blockchain solutions that aren’t constrained by networks or languages. In short, the future of enterprise blockchain is intertwined with interoperability — and it’s closer than you think.</p> <p><em>Bryan Ritchie is CEO of <a href=\"https://simbachain.com/\">SIMBA Chain</a>, the leading API development platform to help companies transition from Web2 to Web3. </em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\"> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>ブロックチェーンの相互運用性とは、複数のネットワークを接続し、データと価値をシームレスに流すことを可能にすることであり、一般消費者向けのアプリケーションにおいてしばしば想定されています。DEXが多数のEVMネットワークをサポートするようになったり、ブロックチェーンブリッジが次のトレンディなDeFiエコシステムにリンクするようになったりすることを思い浮かべてください。\n\n【用語解説】\n・ブロックチェーンの相互運用性：複数のブロックチェーンネットワークを接続し、データや価値をシームレスに流すことができるようにすること。\n・DEX：分散型取引所のこと。\n・EVMネットワーク：Ethereum Virtual Machine（EVM）を採用しているブロックチェーンネットワークのこと。\n・DeFiエコシステム：分散型金融（DeFi）に関連する様々なプロトコルやアプリケーションの集合体のこと。\n\n翻訳・編集　コインテレグラフジャパン</p> <p>「ただ相互運用性を許すことが、トレーダーが気まぐれでチェーンを飛び越えることを可能にする以上の意味を持っている。実際、マルチチェーンの相互運用性の成熟に最も恩恵を受けるのは企業である。企業ソリューションが業界全体で成長するにつれ、単一の孤立したブロックチェーンに存在するのではなく、複数のチェーンと関わる必要性が増しているからだ。」\n\n※相互運用性：異なるシステムやプラットフォーム同士が互いに連携し、データのやり取りができること。 \n※マルチチェーン：複数のブロックチェーンを指す。 \n翻訳・編集　コインテレグラフジャパン</p> <p>ブロックチェーンエコシステムに完全に相互運用可能に接続することの利点は多岐にわたり、将来にわたって対応可能なソリューションをサポートし、ネットワーク効果を複利化することで、共有ビジネスの景観を拡大し、ネットワーク参加者の能力、アクセシビリティ、選択肢を拡大することが容易になります。翻訳・編集　コインテレグラフジャパン</p> <h3>企業が求めるもの</h3> <p>ブロックチェーンは、過去5年間で、サプライチェーン管理からヘルスケアまで、あらゆる種類の企業において利用されるようになりました。アプリケーションは、ビジネス自体と同様に多様でありながら、要求は大まかに似通っています。ブロックチェーンを使用する企業は、基本的にはより高い信頼性、セキュリティ、透明性、データの追跡性を求めています。もし、ブロックチェーンがレガシーシステムよりもこれらの品質をより高い水準で提供できる場合、Web3の利点を既存のソリューションに追加することは明らかです。\n\n翻訳・編集　コインテレグラフジャパン</p> <p>ブロックチェーンは、以前は膨大な人員、物理的なインフラストラクチャー、複数の仲介業者が必要だったプロセスを安全に自動化する能力を持っているため、企業は業務効率を大幅に向上させ、コストを大幅に削減することができます。ただし、すべてのベンダーやサプライヤーに、単一の組織として同じチェーンを使用することを期待することは、特にサプライヤーネットワークが大規模かつ複雑な場合、大規模な採用の可能性を著しく妨げます。\n\n【注釈】\n・ブロックチェーン：分散型台帳技術のこと。\n・仲介業者：インターネットオークションなどで、売り手と買い手の間に入って商品の取引を仲介する業者のこと。\n・ベンダー：商品を提供する業者のこと。\n・サプライヤー：原材料や部品などを提供する業者のこと。\n・採用：新しい技術やシステムを導入すること。 \n\n翻訳・編集　コインテレグラフジャパン</p> <h3>異なるチェーン間の協力</h3> <p>ブロックチェーンプロトコルの選択肢は、数年間でプライベートチェーンとパブリックチェーンの両方において著しく増加しています。各ブロックチェーンには独自の利点と欠点があり、あるチェーンに限定する企業は、異なるブロックチェーン技術が提供する利点の全ポテンシャルを活用できなくなります。翻訳・編集　コインテレグラフジャパン</p> <p>仮に、プライベート・ブロックチェーンは知的財産を保護するのに適しているが、許可制の性質によって制限されている。一方、パブリック・チェーンはグローバルアクセスとより多くのデータポイントを可能にするが、ユーザーは他のエンティティに依存するため、不安定なネットワークコストやボトルネックが発生する可能性がある。翻訳・編集　コインテレグラフジャパン</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">未来を変えることができるコミュニティに参加しましょう。Cointelegraph Innovation Circleは、ブロックチェーン技術のリーダーたちをつなげ、協力し、発信する場を提供します。今すぐ申し込みをしてください。翻訳・編集　コインテレグラフジャパン</p> <p>「これを想像する最も簡単な方法は、道路のシリーズとして考えることです。砂漠の真ん中にある工場は、公共の高速道路に接続されるまで、あまりビジネスを行うことができません。近隣のメーカーと卸売りできるかもしれませんが、地方道路では限界があります。インターステートに接続されると、グローバルに出荷を開始できるようになります。」\n\nこの文章は、ビジネスの成功には適切な接続が必要であることを説明しています。工場が公共の高速道路に接続されることで、より多くのビジネスチャンスが生まれることができます。また、グローバルな市場に参入するためには、インターステートに接続される必要があります。</p> <h3>複数のチェーンが重要である\n\n多くの仮想通貨プロジェクトは、単一のブロックチェーン上で構築されていますが、最近では、複数のチェーンをまたがることがますます一般的になっています。これは、スケーラビリティ、相互運用性、セキュリティ、そして開発の柔軟性を向上させるためです。例えば、ポリゴン(MATIC)は、イーサリアムとBinance Smart Chainの両方で動作することができます。また、ソラナ(SOL)は、独自のチェーン上で動作するだけでなく、他のチェーンとも相互運用性があります。\n\n複数のチェーンをまたがることは、将来的にはより多くのプロジェクトにとって必要不可欠なものになるでしょう。しかし、このアプローチにはいくつかの課題もあります。例えば、異なるチェーン間でのトークンの移動や、異なるチェーン上でのスマートコントラクトの実行には、相互運用性の問題があります。\n\n複数のチェーンをまたがることは、仮想通貨業界においてますます重要になっています。このアプローチには多くの利点がありますが、相互運用性の問題を解決するために、業界全体で協力する必要があります。\n\n翻訳・編集　コインテレグラフジャパン</h3> <p>ブロックチェーンを活用したい企業には選択肢が豊富にある。Quorum、Hyperledger Fabric、Polygon、Ethereumなどの公開およびプライベートソリューションがすべて手軽に利用可能であり、実績もある（Simba ChainはHyperledger FoundationとPolygonの両方と提携している）。ただし、ブロックチェーン間の相互運用性はほとんど存在しない。もしブロックチェーンソリューションがレガシーデータを効果的に共有できず、既存のオンチェーンデータインフラと接続できない場合、その価値提案は深刻な損害を受けることになる。 \n\n翻訳・編集　コインテレグラフジャパン</p> <p>ブロックチェーン間のより高度な相互運用性を妨げる最大の障害の1つは、共有のプログラミング言語の欠如である。これにより、マルチチェーンアプリケーションの作成にかかるコストと複雑さが増大しています。翻訳・編集　コインテレグラフジャパン</p> <h3>相互運用可能な未来\n\nブロックチェーン技術の進化により、異なるプラットフォーム間での相互運用性がますます注目されている。相互運用性があることで、異なるブロックチェーン間でのデータや資産のやりとりがスムーズになり、より効率的な取引が可能になる。\n\n最近、ステーブルコインの発行会社であるCentreは、ETHとAlgorandのブロックチェーン間での相互運用性を実現するためのプロトコルを発表した。このプロトコルにより、Centreが発行するUSDCステーブルコインが、ETHとAlgorandの両方のブロックチェーン上で使用可能になる。\n\nCentreのCEOであるJeremy Allaireは、「相互運用性は、ブロックチェーン技術が実現する真の価値の一つである。我々は、異なるブロックチェーン間での相互運用性を実現することで、よりオープンで効率的なグローバルな金融システムを実現することを目指している」と述べている。\n\n今後も、異なるブロックチェーン間での相互運用性を実現するためのプロトコルや技術が開発され、よりオープンで効率的なグローバルな金融システムが実現されることが期待される。\n\n翻訳・編集　コインテレグラフジャパン</h3> <p>多チェーンソリューションは異なるチェーン間の機能性の障壁を取り除く上で重要な役割を果たすことができるが、一方で完全な相互運用性を一方的に提供することはできない。このより広範な問題を解決するには、ブロックチェーンエコシステム内の基盤層からアプリケーション層まで、様々な企業の取り組みが必要となる。過去2年間、この課題に数多くの時間と資金が投じられ、その成果が現れ始めている。\n\n翻訳・編集　コインテレグラフジャパン</p> <p>ブロックチェーンのブリッジは繁栄しており、トークンを移動するためだけでなく、クロスチェーンメッセージングは、スマートコントラクトをトリガーし、サードパーティアプリケーションからデータをクエリし、異なるチェーンで開始されたイベントを解決するために、日常的に使用されています。</p> <p>マルチチェーンアプリケーションが開発されており、どのエコシステムにも束縛されず、最適なレートで流動性またはデータを提供するチェーンからそれを取得することができるようになっています。これらのイノベーションにより、マルチチェーン環境を活用するアプリケーションを作成するために100人の開発者チームが必要なくなりました。その結果、中小企業、大企業、政府機関もこの強力な機能を活用することができます。\n\n（マルチチェーン環境：複数のブロックチェーンが相互に接続された環境）\n\n翻訳・編集　コインテレグラフジャパン</p> <p>企業の多様性を考えると、プライベートやパブリックのチェーンをまたいだブロックチェーンソリューションを提供する企業が登場するのは避けられません。同様に、これらの孤立したシステムが一つになるようなソリューションも登場するでしょう。これにより、ネットワークや言語に制限されない強力なブロックチェーンソリューションを作成することが可能になります。つまり、企業ブロックチェーンの未来は相互運用性と密接に関わっており、それはあなたが思っているよりも近い未来に実現するでしょう。\n\n【用語解説】\n・ブロックチェーン：blockchain\n・プライベートチェーン：private chain\n・パブリックチェーン：public chain\n・孤立したシステム：siloed systems\n・相互運用性：interoperability\n\n翻訳・編集　コインテレグラフジャパン</p> <p>SIMBA ChainのCEOであるブライアン・リッチー氏は、Web2からWeb3への移行を支援するAPI開発プラットフォームのリーディング企業です。翻訳・編集 コインテレグラフジャパン</p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\"/> </div> </div> <p>この記事は、ブロックチェーン技術業界のシニアエグゼクティブや専門家からなる慎重に選ばれた組織である「Cointelegraph Innovation Circle」を通じて公開されました。この組織は、つながり、協力、リーダーシップの力を通じて未来を構築しています。ここに表明された意見は、必ずしもCointelegraphの見解を反映するものではありません。翻訳・編集　コインテレグラフジャパン</p> <p>コインテレグラフ・イノベーション・サークルについてもっと知り、参加資格があるか確認してください。翻訳・編集　コインテレグラフジャパン</p></div>"],[2954,"5 Natural language processing libraries to use","2023-04-11 18:07:00","https://cointelegraph.com/news/5-natural-language-processing-libraries-to-use","Natural language processing (NLP) is important because it enables machines to understand, interpret and generate human language, which is the primary means of communication between people. By using NLP, machines can analyze and make sense of large amounts of unstructured textual data, improving their ability to assist humans in various tasks, such as customer service, content creation and decision-making. Additionally, NLP can help bridge language barriers, improve accessibility for individuals with disabilities, and support research in various fields, such as linguistics, psychology and social sciences.Here are five NLP libraries that can be used for various purposes, as discussed below.NLTK (Natural Language Toolkit)One of the most widely used programming languages for NLP is Python, which has a rich ecosystem of libraries and tools for NLP, including the NLTK. Python’s popularity in the data science and machine learning communities, combined with the ease of use and extensive documentation of NLTK, has made it a go-to choice for many NLP projects.NLTK is a widely used NLP library in Python. It offers NLP machine-learning capabilities for tokenization, stemming, tagging and parsing. NLTK is great for beginners and is used in many academic courses on NLP.Tokenization is the process of dividing a text into more manageable pieces, like specific words, phrases or sentences. Tokenization aims to give the text a structure that makes programmatic analysis and manipulation easier. A frequent pre-processing step in NLP applications, such as text categorization or sentiment analysis, is tokenization.Words are derived from their base or root form through the process of stemming. For instance, “run” is the root of the terms “running,” “runner,” and “run.“ Tagging involves identifying each word’s part of speech (POS) within a document, such as a noun, verb, adjective, etc.. In many NLP applications, such as text analysis or machine translation, where knowing the grammatical structure of a phrase is critical, POS tagging is a crucial step.Parsing is the process of analyzing the grammatical structure of a sentence to identify the relationships between the words. Parsing involves breaking down a sentence into constituent parts, such as subject, object, verb, etc. Parsing is a crucial step in many NLP tasks, such as machine translation or text-to-speech conversion, where understanding the syntax of a sentence is important.Related: How to improve your coding skills using ChatGPT?SpaCySpaCy is a fast and efficient NLP library for Python. It is designed to be easy to use and provides tools for entity recognition, part-of-speech tagging, dependency parsing and more. SpaCy is widely used in the industry for its speed and accuracy.Dependency parsing is a natural language processing technique that examines the grammatical structure of a phrase by determining the relationships between words in terms of their syntactic and semantic dependencies, and then building a parse tree that captures these relationships.2- A natural language processing (NLP) library: Choose an NLP library that can help your system understand the intent behind the user's voice commands. Some popular options are Natural Language Toolkit (NLTK) or spaCy.— General ⚔ (@GeneralAptos) April 1, 2023\n\nStanford CoreNLPStanford CoreNLP is a Java-based NLP library that provides tools for a variety of NLP tasks, such as sentiment analysis, named entity recognition, dependency parsing and more. It is known for its accuracy and is used by many organizations.Extracting opinion phrases from user reviews with Stanford CoreNLP http://t.co/t6VIzfNRfz #machinelearning #nlp pic.twitter.com/RHiTl40Q7c— Julian Hillebrand (@JulianHi) September 11, 2014\n\nSentiment analysis is the process of analyzing and determining the subjective tone or attitude of a text, while named entity recognition is the process of identifying and extracting named entities, such as names, locations and organizations, from a text.GensimGensim is an open-source library for topic modeling, document similarity analysis and other NLP tasks. It provides tools for algorithms such as latent dirichlet allocation (LDA) and word2vec for generating word embeddings.LDA is a probabilistic model used for topic modeling, where it identifies the underlying topics in a set of documents. Word2vec is a neural network-based model that learns to map words to vectors, enabling semantic analysis and similarity comparisons between words.TensorFlowTensorFlow is a popular machine-learning library that can also be used for NLP tasks. It provides tools for building neural networks for tasks such as text classification, sentiment analysis and machine translation. TensorFlow is widely used in industry and has a large support community.BEST TensorFlow Books for #DataScientists! #BigData #Analytics #DataScience #IoT #IIoT #PyTorch #Python #RStats #TensorFlow #Java #JavaScript #ReactJS #GoLang #CloudComputing #Serverless #DataScientist #Linux #Books #Programming #Coding #100DaysofCode https://t.co/LDzmqX169M pic.twitter.com/IQeaV3U5sD— Dr. Ganapathi Pulipaka  (@gp_pulipaka) April 7, 2023\n\nClassifying text into predetermined groups or classes is known as text classification. Sentiment analysis examines a text’s subjective tone to ascertain the author’s attitude or feelings. Machines translate text from one language into another. While all use natural language processing techniques, their objectives are distinct.Can NLP libraries and blockchain be used together?NLP libraries and blockchain are two distinct technologies, but they can be used together in various ways. For instance, text-based content on blockchain platforms, such as smart contracts and transaction records, can be analyzed and understood using NLP approaches. NLP can also be applied to creating natural language interfaces for blockchain applications, allowing users to communicate with the system using everyday language. The integrity and privacy of user data can be guaranteed by using blockchain to protect and validate NLP-based apps, such as chatbots or sentiment analysis tools.Related: Data protection in AI chatting: Does ChatGPT comply with GDPR standards?","<div class=\"post-content\" data-v-2ab31f4e><p>Natural language processing (NLP) is important because it enables machines to understand, interpret and generate human language, which is the primary means of communication between people. By using NLP, machines can analyze and make sense of large amounts of unstructured textual data, improving their ability to assist humans in various tasks, such as customer service, content creation and decision-making. </p><p>Additionally, NLP can help bridge language barriers, improve accessibility for individuals with disabilities, and support research in various fields, such as <a href=\"https://cointelegraph.com/news/how-to-use-chatgpt-to-learn-a-language\">linguistics</a>, psychology and social sciences.</p><p>Here are five NLP libraries that can be used for various purposes, as discussed below.</p><h2>NLTK (Natural Language Toolkit)</h2><p>One of the most widely used programming languages for NLP is Python, which has a rich ecosystem of libraries and tools for NLP, including the NLTK. Python’s popularity in the data science and machine learning communities, combined with the ease of use and extensive documentation of NLTK, has made it a go-to choice for many NLP projects.</p><p>NLTK is a widely used NLP library in Python. It offers NLP <a href=\"https://cointelegraph.com/news/5-key-features-of-machine-learning\">machine-learning</a> capabilities for tokenization, stemming, tagging and parsing. NLTK is great for beginners and is used in many academic courses on NLP.</p><p>Tokenization is the process of dividing a text into more manageable pieces, like specific words, phrases or sentences. Tokenization aims to give the text a structure that makes programmatic analysis and manipulation easier. A frequent pre-processing step in NLP applications, such as text categorization or sentiment analysis, is tokenization.</p><p>Words are derived from their base or root form through the process of stemming. For instance, “run” is the root of the terms “running,” “runner,” and “run.“ Tagging involves identifying each word’s part of speech (POS) within a document, such as a noun, verb, adjective, etc.. In many NLP applications, such as text analysis or machine translation, where knowing the grammatical structure of a phrase is critical, POS tagging is a crucial step.</p><p>Parsing is the process of analyzing the grammatical structure of a sentence to identify the relationships between the words. Parsing involves breaking down a sentence into constituent parts, such as subject, object, verb, etc. Parsing is a crucial step in many NLP tasks, such as machine translation or text-to-speech conversion, where understanding the syntax of a sentence is important.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/how-to-improve-your-coding-skills-using-chatgpt\">How to improve your coding skills using ChatGPT?</a></em></strong></p><h2>SpaCy</h2><p>SpaCy is a fast and efficient NLP library for Python. It is designed to be easy to use and provides tools for entity recognition, part-of-speech tagging, dependency parsing and more. SpaCy is widely used in the industry for its speed and accuracy.</p><p>Dependency parsing is a natural language processing technique that examines the grammatical structure of a phrase by determining the relationships between words in terms of their syntactic and semantic dependencies, and then building a parse tree that captures these relationships.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2- A natural language processing (NLP) library: Choose an NLP library that can help your system understand the intent behind the user's voice commands. Some popular options are Natural Language Toolkit (NLTK) or spaCy.</p>— General ⚔ (@GeneralAptos) <a href=\"https://twitter.com/GeneralAptos/status/1642231037047582722?ref_src=twsrc%5Etfw\">April 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Stanford CoreNLP</h2><p>Stanford CoreNLP is a Java-based NLP library that provides tools for a variety of NLP tasks, such as sentiment analysis, named entity recognition, dependency parsing and more. It is known for its accuracy and is used by many organizations.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Extracting opinion phrases from user reviews with Stanford CoreNLP <a href=\"http://t.co/t6VIzfNRfz\">http://t.co/t6VIzfNRfz</a> <a href=\"https://twitter.com/hashtag/machinelearning?src=hash&amp;ref_src=twsrc%5Etfw\">#machinelearning</a> <a href=\"https://twitter.com/hashtag/nlp?src=hash&amp;ref_src=twsrc%5Etfw\">#nlp</a> <a href=\"http://t.co/RHiTl40Q7c\">pic.twitter.com/RHiTl40Q7c</a></p>— Julian Hillebrand (@JulianHi) <a href=\"https://twitter.com/JulianHi/status/510172682789617665?ref_src=twsrc%5Etfw\">September 11, 2014</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Sentiment analysis is the process of analyzing and determining the subjective tone or attitude of a text, while named entity recognition is the process of identifying and extracting named entities, such as names, locations and organizations, from a text.</p><h2>Gensim</h2><p>Gensim is an <a href=\"https://cointelegraph.com/news/the-importance-of-open-source-in-computer-science-and-software-development\">open-source</a> library for topic modeling, document similarity analysis and other NLP tasks. It provides tools for algorithms such as latent dirichlet allocation (LDA) and word2vec for generating word embeddings.</p><p>LDA is a probabilistic model used for topic modeling, where it identifies the underlying topics in a set of documents. Word2vec is a neural network-based model that learns to map words to vectors, enabling semantic analysis and similarity comparisons between words.</p><h2>TensorFlow</h2><p>TensorFlow is a popular machine-learning library that can also be used for NLP tasks. It provides tools for building neural networks for tasks such as text classification, sentiment analysis and machine translation. TensorFlow is widely used in industry and has a large support community.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BEST TensorFlow Books for <a href=\"https://twitter.com/hashtag/DataScientists?src=hash&amp;ref_src=twsrc%5Etfw\">#DataScientists</a>! <a href=\"https://twitter.com/hashtag/BigData?src=hash&amp;ref_src=twsrc%5Etfw\">#BigData</a> <a href=\"https://twitter.com/hashtag/Analytics?src=hash&amp;ref_src=twsrc%5Etfw\">#Analytics</a> <a href=\"https://twitter.com/hashtag/DataScience?src=hash&amp;ref_src=twsrc%5Etfw\">#DataScience</a> <a href=\"https://twitter.com/hashtag/IoT?src=hash&amp;ref_src=twsrc%5Etfw\">#IoT</a> <a href=\"https://twitter.com/hashtag/IIoT?src=hash&amp;ref_src=twsrc%5Etfw\">#IIoT</a> <a href=\"https://twitter.com/hashtag/PyTorch?src=hash&amp;ref_src=twsrc%5Etfw\">#PyTorch</a> <a href=\"https://twitter.com/hashtag/Python?src=hash&amp;ref_src=twsrc%5Etfw\">#Python</a> <a href=\"https://twitter.com/hashtag/RStats?src=hash&amp;ref_src=twsrc%5Etfw\">#RStats</a> <a href=\"https://twitter.com/hashtag/TensorFlow?src=hash&amp;ref_src=twsrc%5Etfw\">#TensorFlow</a> <a href=\"https://twitter.com/hashtag/Java?src=hash&amp;ref_src=twsrc%5Etfw\">#Java</a> <a href=\"https://twitter.com/hashtag/JavaScript?src=hash&amp;ref_src=twsrc%5Etfw\">#JavaScript</a> <a href=\"https://twitter.com/hashtag/ReactJS?src=hash&amp;ref_src=twsrc%5Etfw\">#ReactJS</a> <a href=\"https://twitter.com/hashtag/GoLang?src=hash&amp;ref_src=twsrc%5Etfw\">#GoLang</a> <a href=\"https://twitter.com/hashtag/CloudComputing?src=hash&amp;ref_src=twsrc%5Etfw\">#CloudComputing</a> <a href=\"https://twitter.com/hashtag/Serverless?src=hash&amp;ref_src=twsrc%5Etfw\">#Serverless</a> <a href=\"https://twitter.com/hashtag/DataScientist?src=hash&amp;ref_src=twsrc%5Etfw\">#DataScientist</a> <a href=\"https://twitter.com/hashtag/Linux?src=hash&amp;ref_src=twsrc%5Etfw\">#Linux</a> <a href=\"https://twitter.com/hashtag/Books?src=hash&amp;ref_src=twsrc%5Etfw\">#Books</a> <a href=\"https://twitter.com/hashtag/Programming?src=hash&amp;ref_src=twsrc%5Etfw\">#Programming</a> <a href=\"https://twitter.com/hashtag/Coding?src=hash&amp;ref_src=twsrc%5Etfw\">#Coding</a> <a href=\"https://twitter.com/hashtag/100DaysofCode?src=hash&amp;ref_src=twsrc%5Etfw\">#100DaysofCode</a> <a href=\"https://t.co/LDzmqX169M\">https://t.co/LDzmqX169M</a> <a href=\"https://t.co/IQeaV3U5sD\">pic.twitter.com/IQeaV3U5sD</a></p>— Dr. Ganapathi Pulipaka  (@gp_pulipaka) <a href=\"https://twitter.com/gp_pulipaka/status/1644380026526203904?ref_src=twsrc%5Etfw\">April 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Classifying text into predetermined groups or classes is known as text classification. Sentiment analysis examines a text’s subjective tone to ascertain the author’s attitude or feelings. Machines translate text from one language into another. While all use natural language processing techniques, their objectives are distinct.</p><h2>Can NLP libraries and blockchain be used together?</h2><p>NLP libraries and <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain</a> are two distinct technologies, but they can be used together in various ways. For instance, text-based content on blockchain platforms, such as <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a> and transaction records, can be analyzed and understood using NLP approaches. </p><p>NLP can also be applied to creating natural language interfaces for blockchain applications, allowing users to communicate with the system using everyday language. The integrity and privacy of user data can be guaranteed by using blockchain to protect and validate NLP-based apps, such as chatbots or sentiment analysis tools.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/learn/data-protection-in-ai-chatting-does-chatgpt0comply-with-gdpr-standards\">Data protection in AI chatting: Does ChatGPT comply with GDPR standards?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>自然言語処理（NLP）は重要である。なぜなら、人間同士の主要なコミュニケーション手段である人間の言語を、機械が理解、解釈、生成できるようにするからだ。NLPを使用することで、機械は大量の非構造化テキストデータを分析し、理解することができるため、顧客サービス、コンテンツ作成、意思決定など、様々なタスクで人間を支援する能力を向上させることができる。\n\n翻訳・編集　コインテレグラフジャパン</p><p>さらに、自然言語処理は言語の壁を取り除くのに役立ち、障がいを持つ個人のアクセシビリティを向上させ、言語学、心理学、社会科学などの様々な分野の研究を支援することができます。翻訳・編集　コインテレグラフジャパン</p><p>以下に、様々な目的に使用できる5つのNLPライブラリが紹介されています。</p><h2>NLTK（Natural Language Toolkit）とは、自然言語処理のためのツールキットである。</h2><p>Pythonは、NLPに最も広く使用されているプログラミング言語の1つであり、NLTKを含むNLPの豊富なライブラリやツールのエコシステムを持っています。Pythonは、データサイエンスや機械学習コミュニティでの人気と、NLTKの使いやすさと豊富なドキュメンテーションの組み合わせにより、多くのNLPプロジェクトでの選択肢となっています。\n\n【用語解説】\n・NLP：自然言語処理\n・Python：プログラミング言語の一種\n・NLTK：自然言語処理のためのPythonパッケージ\n\n翻訳・編集　コインテレグラフジャパン</p><p>Pythonで広く使われているNLPライブラリの1つであるNLTKは、トークン化、ステミング、タグ付け、構文解析などのNLP機械学習機能を提供しています。NLTKは初心者にとっても優れており、多くのNLPの学術コースで使用されています。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「トークン化」とは、テキストを特定の単語、フレーズ、または文に分割するプロセスのことです。トークン化は、プログラム的な分析や操作を容易にするために、テキストに構造を与えることを目的としています。テキストのカテゴリ分けや感情分析などの自然言語処理（NLP）アプリケーションにおいて、トークン化は頻繁に前処理ステップとして使用されます。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「語幹抽出」というプロセスを通じて、単語はその基本形や語根形から派生します。例えば、「run」は「running」「runner」「run」の語の語幹です。一方、「タギング」とは、文書内の各単語の品詞（名詞、動詞、形容詞など）を特定することを指します。テキスト分析や機械翻訳など、フレーズの文法構造を知ることが重要な自然言語処理（NLP）アプリケーションにおいては、品詞タギングが重要なステップとなります。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「パーシング」とは、文の文法的構造を分析して単語間の関係を特定するプロセスのことである。主語、目的語、動詞などの構成要素に文を分解することがパーシングの目的である。パーシングは、機械翻訳やテキスト読み上げなどの自然言語処理タスクにおいて、文の構文を理解することが重要なため、重要なステップである。\n\n翻訳・編集 コインテレグラフジャパン</p><p>関連記事：ChatGPTを使ってコーディングスキルを向上させる方法は？　翻訳・編集　コインテレグラフジャパン</p><h2>SpaCy</h2><p>「SpaCy」とは、Python向けの高速かつ効率的な自然言語処理ライブラリである。エンティティ認識、品詞タグ付け、依存構文解析などのツールを提供し、使いやすさを重視して設計されている。SpaCyは、その速度と精度から、産業界で広く利用されている。翻訳・編集　コインテレグラフジャパン</p><p>依存構文解析は、自然言語処理の技術の一つであり、構文的・意味的な依存関係に基づいて単語間の関係を決定し、それらを捉えた構文木を作成することで、句の文法構造を分析する手法である。翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">自然言語処理（NLP）ライブラリ：ユーザーの音声コマンドの意図を理解するのに役立つNLPライブラリを選択してください。人気のあるオプションには、Natural Language Toolkit（NLTK）やspaCyがあります。翻訳・編集　コインテレグラフジャパン</p>— General ⚔ (@GeneralAptos) <a href=\"https://twitter.com/GeneralAptos/status/1642231037047582722?ref_src=twsrc%5Etfw\">仮想通貨取引所「ビットコインジャパン」は、今日から新しいステーブルコイン「ビットコインドル」を取り扱い始める。このステーブルコインは、1ビットコインにつき3万ドル(約330万円)で取引される。ビットコインジャパンの広報担当者は、「ビットコインドルは、ビットコインの価格変動に左右されず、ドルと同等の価値を持つ」と述べている。また、同社は今後、ビットコイン以外の仮想通貨に対応したステーブルコインの取り扱いも検討しているという。\n\nステーブルコインとは、価格変動が少なく、安定した価値を持つ仮想通貨のことである。ビットコインジャパンが取り扱うビットコインドルは、ドルと同等の価値を持つため、ビットコインの価格変動に左右されず、ビットコインを保有する投資家にとってはリスクヘッジの手段として有用であると言える。\n\n「ビットコインドルの取り扱い開始により、ビットコインジャパンはより多くの投資家にサービスを提供できるようになる」と同社の広報担当者は述べている。ビットコインジャパンは、今後も新しいサービスの提供に取り組んでいくとしている。\n\n翻訳・編集　コインテレグラフジャパン</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<h2>スタンフォード・コアNLP</h2><p>スタンフォード・コアNLPは、感情分析、固有表現認識、依存構文解析など、様々なNLPタスクのためのツールを提供するJavaベースのNLPライブラリです。その精度の高さで知られ、多くの組織によって使用されています。翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">スタンフォードCoreNLPを使用してユーザーレビューから意見フレーズを抽出する http://t.co/t6VIzfNRfz #機械学習 #自然言語処理 pic.twitter.com/RHiTl40Q7c\n翻訳・編集　コインテレグラフジャパン</p>— Julian Hillebrand (@JulianHi) <a href=\"https://twitter.com/JulianHi/status/510172682789617665?ref_src=twsrc%5Etfw\">ビットコインの価格が、今週初めにUS$500を超えた。これは、今年初めにはUS$1,000を超えていた価格からは大幅に下落したものである。ビットコインは、2013年にはUS$13からUS$1,200まで急騰し、その後急落した。ビットコインは、分散型の暗号通貨であり、中央銀行や政府による管理がない。ビットコインは、ツイッターで「仮想通貨の黄金」と呼ばれている。\n\nステーブルコインは、ビットコインの価格変動に対する解決策として注目を集めている。ステーブルコインは、ビットコインと同じように分散型の暗号通貨であるが、価格が安定している。ステーブルコインは、米ドルやユーロなどの通貨にペッグされており、価格変動が少ないため、ビットコインよりも実用的であるとされている。\n\n翻訳・編集　コインテレグラフジャパン</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<p>感情分析とは、テキストの主観的なトーンや態度を分析し決定するプロセスであり、一方、固有表現認識とは、テキストから名前、場所、組織などの固有表現を識別・抽出するプロセスである。翻訳・編集　コインテレグラフジャパン。</p><h2>「Gensim」とは、Pythonで書かれたオープンソースの自然言語処理ライブラリである。テキストデータをトピックモデルや単語ベクトルに変換することができ、機械学習や情報検索に役立つ。また、Word2Vecというアルゴリズムを実装しており、単語の意味をベクトル化することができる。これにより、単語同士の関係性を数値化して解析することができるようになる。Gensimは、大規模なテキストデータの処理にも対応しており、高速で効率的な処理が可能である。\n\n翻訳・編集　コインテレグラフジャパン</h2><p>Gensimはトピックモデリング、文書の類似性分析、その他のNLPタスクのためのオープンソースライブラリである。潜在ディリクレ配分（LDA）やword2vecなどのアルゴリズムに対して、単語の埋め込みを生成するためのツールを提供している。翻訳・編集　コインテレグラフジャパン</p><p>LDAは、文書の中にある潜在的なトピックを特定するために使用される確率モデルである。一方、Word2vecは、単語をベクトルにマッピングすることを学習するニューラルネットワークベースのモデルであり、単語の意味解析や類似性比較を可能にする。</p><h2>TensorFlowとは、Googleが開発したオープンソースの機械学習フレームワークである。ディープラーニングによる画像認識や音声認識、自然言語処理などのタスクに利用される。TensorFlowはPythonやC++などの言語で利用可能であり、GPUを使用することで高速な演算が可能である。また、TensorFlowは分散処理にも対応しており、大規模なデータセットにも対応可能である。最新のバージョンはTensorFlow 2.0である。\n\n翻訳・編集　コインテレグラフジャパン</h2><p>「TensorFlow」という機械学習ライブラリは、NLPタスクにも使用できる人気の高いものである。テキスト分類、感情分析、機械翻訳などのタスクに対してニューラルネットワークを構築するためのツールを提供している。TensorFlowは産業界で広く使用され、大きなサポートコミュニティがある。翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">データサイエンティストにおすすめのBEST TensorFlow書籍！ #ビッグデータ #アナリティクス #データサイエンス #IoT #IIoT #PyTorch #Python #RStats #TensorFlow #Java #JavaScript #ReactJS #GoLang #クラウドコンピューティング #サーバーレス #データサイエンティスト #Linux #書籍 #プログラミング #コーディング #100DaysOfCode https://t.co/LDzmqX169M pic.twitter.com/IQeaV3U5sD\n翻訳・編集　コインテレグラフジャパン</p>— Dr. Ganapathi Pulipaka  (@gp_pulipaka) <a href=\"https://twitter.com/gp_pulipaka/status/1644380026526203904?ref_src=twsrc%5Etfw\">2023年4月7日</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<p>「テキスト分類」とは、あらかじめ決められたグループやクラスにテキストを分類することを指します。「感情分析」とは、テキストの主観的なトーンを調べ、著者の態度や感情を把握することです。機械はテキストを一つの言語から別の言語に翻訳します。これらすべてが自然言語処理技術を使用していますが、それぞれの目的は異なります。\n\n※テキスト分類：あるテキストをあらかじめ決められたカテゴリーに分類すること。\n※感情分析：文章の感情を分析すること。\n※自然言語処理技術：人間が使う自然言語をコンピュータが処理する技術。\n\n翻訳・編集　コインテレグラフジャパン</p><h2>NLPライブラリとブロックチェーンは一緒に使えるか？</h2><p>「NLPライブラリ」と「ブロックチェーン」は異なる技術であるが、様々な方法で共に使用することができる。例えば、スマートコントラクトやトランザクション履歴など、ブロックチェーンプラットフォーム上のテキストベースのコンテンツは、NLPアプローチを用いて分析や理解が可能である。翻訳・編集　コインテレグラフジャパン</p><p>ブロックチェーンアプリケーションの自然言語インターフェースを作成するためにも、NLPを適用することができます。これにより、ユーザーは日常的な言葉を使ってシステムとコミュニケーションを取ることができます。チャットボットやセンチメント分析ツールなど、NLPベースのアプリケーションをブロックチェーンで保護し、検証することで、ユーザーデータの完全性とプライバシーを保証することができます。\n\n翻訳・編集　コインテレグラフジャパン</p><p>関連記事：AIチャットにおけるデータ保護：ChatGPTはGDPR基準に適合しているか？　翻訳・編集　コインテレグラフジャパン</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></div>"],[2955,"Bitcoin miner CleanSpark purchases 45,000 ASICs for $145M","2023-04-11 16:11:25","https://cointelegraph.com/news/bitcoin-miner-cleanspark-purchases-45-000-asics-for-145m","On April 11, American Bitcoin (BTC) miner CleanSpark announced that it purchased 45,000 Antminer S19 XP application-specific integrated circuit (ASIC) mining rigs for $144.9 million. CleanSpark said all the units will be ready for delivery by Antminer before the end of September. The purchase is expected to add 6.3 exahashes per second (EH/s) of mining power to its rig, which currently possesses a capacity of 6.7 EH/s.After the purchase, the firm’s expected hash rate will account for an estimated 3.8% of the entire Bitcoin network. Zach Bradford, CEO of CleanSpark, commented: “The Antminer S19 XP is the most power-efficient bitcoin mining machine available in the market today, and a key component in our continuing work to build some of the most efficient bitcoin mining facilities in the country.”25,000 of the 45,000 ASICs will be delivered in August, while the remaining 20,000 units are expected to be ready in September. CleanSpark said it plans to deploy all the acquired units at its Bitcoin mining facility in Sandersville, Georgia, which is currently undergoing a 150-megawatt power expansion.“This bear market has continued to provide us with opportunities to maximize ROI, including the opportunity to purchase the industry's best miner at an industry-leading price.”CleanSpark has set a goal of reaching 16 EH/s in hash rate by the end of 2023. In February, the firm purchased 20,000 ASICs scheduled for operations this quarter. CleanSpark claimed that over 90% of its mining electricity stems from “low-carbon energy sources.” At the end of 2022, the firm possessed $486.8 million in total assets and $59.8 million in total liabilities.Magazine: Account abstraction supercharges Ethereum wallets: Dummies guide ","<div class=\"post-content\" data-v-2ab31f4e><p>On April 11, American Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miner CleanSpark announced that it purchased 45,000 Antminer S19 XP application-specific integrated circuit (ASIC) mining rigs for $144.9 million. CleanSpark said all the units will be ready for delivery by Antminer before the end of September. The purchase is expected to add 6.3 exahashes per second (EH/s) of mining power to its rig, which currently possesses a capacity of 6.7 EH/s.</p><p>After the purchase, the firm’s expected hash rate will <a href=\"https://ycharts.com/indicators/bitcoin_network_hash_rate\" target=\"_blank\" rel=\"noopener nofollow\">account</a> for an estimated 3.8% of the entire Bitcoin network. Zach Bradford, CEO of CleanSpark, commented: </p><blockquote>“The Antminer S19 XP is the most power-efficient bitcoin mining machine available in the market today, and a key component in our continuing work to build some of the most efficient bitcoin mining facilities in the country.”</blockquote><p>25,000 of the 45,000 ASICs will be delivered in August, while the remaining 20,000 units are expected to be ready in September. CleanSpark said it plans to deploy all the acquired units at its Bitcoin mining facility in Sandersville, Georgia, which is currently undergoing a 150-megawatt power expansion.</p><blockquote>“This bear market has continued to provide us with opportunities to maximize ROI, including the opportunity to purchase the industry's best miner at an industry-leading price.”</blockquote><p>CleanSpark has set a goal of reaching 16 EH/s in hash rate by the end of 2023. In February, the firm purchased 20,000 ASICs scheduled for operations this quarter. CleanSpark claimed that over 90% of its mining electricity stems from “low-carbon energy sources.” At the end of 2022, the firm <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/0000827876/000095017023002371/clsk-20221231.htm\" target=\"_blank\" rel=\"noopener nofollow\">possessed</a> $486.8 million in total assets and $59.8 million in total liabilities.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/account-abstraction-supercharges-ethereum-wallets-dummies-guide/\">Account abstraction supercharges Ethereum wallets: Dummies guide</a></em> </strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>CleanSpark、Antminer S19 XP ASICマイニングリグ45,000台を1億4,490万ドルで購入\n\nアメリカのビットコイン(BTC)マイナーであるCleanSparkは4月11日、Antminer S19 XPアプリケーション固有の統合回路(ASIC)マイニングリグ45,000台を1億4,490万ドルで購入したことを発表した。CleanSparkは、すべてのユニットが9月末までにAntminerからの納品準備ができると述べた。この購入により、現在6.7 EH/sの能力を持つ同社のリグに6.3 EH/sのマイニングパワーが追加されることが期待されている。\n\n翻訳・編集　コインテレグラフジャパン</p><p>CleanSpark社は、この買収により、同社の予想ハッシュレートがBitcoinネットワーク全体の約3.8％に相当すると予想される。CleanSparkのCEOであるZach Bradford氏は、「〜と述べた」とコメントしています。翻訳・編集　コインテレグラフジャパン</p><blockquote>“The Antminer S19 XP is the most power-efficient bitcoin mining machine available in the market today, and a key component in our continuing work to build some of the most efficient bitcoin mining facilities in the country.”</blockquote><p>CleanSparkは、45,000台のASICのうち25,000台が8月に、残りの20,000台が9月に届く予定であると発表した。同社は、現在150メガワットの電力拡張を進めているジョージア州サンダースビルにあるビットコインマイニング施設に、すべての取得ユニットを展開する計画であると述べた。　翻訳・編集　コインテレグラフジャパン</p><blockquote>“This bear market has continued to provide us with opportunities to maximize ROI, including the opportunity to purchase the industry's best miner at an industry-leading price.”</blockquote><p>CleanSpark、2023年末までにハッシュレート16 EH/sを達成することを目標に設定した。同社は2月に、今四半期に稼働予定のASIC 20,000台を購入した。CleanSparkは、同社のマイニング電力の90％以上が「低炭素エネルギー源」から発生していると主張している。2022年末には、同社の総資産は4億8680万ドル、総負債は5980万ドルであった。\n\n翻訳・編集　コインテレグラフジャパン</p><p>マガジン：アカウント抽象化がEthereumウォレットを強化：初心者向けガイド</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></div>"],[2956,"GPT-4 apps BabyAGI and AutoGPT could have disruptive implications for crypto","2023-04-11 22:55:00","https://cointelegraph.com/news/gpt-4-apps-babyagi-and-autogpt-could-have-disruptive-implications-for-crypto","A recent spate of applications built on OpenAI’s GPT-4 API has the crypto community buzzing with designs toward the development of a fully-autonomous, self-correcting cryptocurrency trading bot.AutoGPT set to 100 runs. Goal: amalgamate best indicators for Crypto trading in Pine  code. Result looping errors. Scavenged through output, found enough bits for GPT4 to give me strategy Pine code. 4hr backtested 2018 to now. $25 to $92M. Started test today, currently $1 profit— Under_the_Valley.MI (@ValleyUnder) April 11, 2023\n\nTwo such apps, dubbed “BabyAGI” and “AutoGPT,” have received particular notice, with many users attempting to build crypto trading applications on top of them. The big idea behind both apps involves task management for GPT-4. Currently, GPT-4 excels at natural language processing, as is evidenced by the demonstrable usefulness of the ChatGPT interface, but it has no capacity for memorization.Applications built on the GPT API are basically limited to single-session use, meaning the model can’t recall information from previous interactions. This has to do with the amount of data (referred to as the number of “tokens”) that individual queries require, as well as GPT’s tendency to hallucinate — a problem that becomes increasingly noticeable as token counts rise. Users are, essentially, starting with a clean slate whenever they query the machine. In terms of building a crypto trading application capable of self-correction and historiographic analysis — adjusting to real-time market conditions while simultaneously keeping short and long-term trends in focus — this means even the most robust bot built on the GPT API would typically require heavy human supervision. Related: Tech giant Alibaba to roll out ChatGPT competitor AISome clever developers may have discerned a potential method for circumventing these limitations by building applications that take advantage of GPT’s ability to generate code and connect to external sources.We’ve seen our fair share of trading bots, but the goal of these particular apps goes beyond simply automating crypto news aggregation or teaching a machine learning agent how to recognize the dip. AutoGPT, for example, uses GPT-4 to generate code and then exploits GPT-3.5 to create what appears to be a virtual artificial memory space wherein information is combined and shuttled between the two. Another effort, BabyAGI, combines GPT-4 with LangChain, a coding framework, and Pinecone, a vector database, to spawn new agents in order to complete complex tasks without losing focus on the original objective. Both apps could have the potential to serve as the backbone for a multi-agent, fire-and-forget AI application capable of managing a crypto portfolio from top to bottom based on little more than plain language prompting.While it appears neither app was specifically designed with the cryptocurrency market in mind, we’ve spotted several efforts across social media and on GitHub to adapt one or both for autonomous trading.#AutoGPT using #GPT4 finds another article on the Forbes website.PLAN: -  Browse the Forbes article-  Identify the top AI crypto currencies-  Add each currency to my list of top contendersCRITICISM: I must ensure that I consider multiple sources and compare the information.. pic.twitter.com/Lbh24eX18X— Mr. Harrison (@Harriso20462924) April 9, 2023\n\n","<div class=\"post-content\" data-v-2ab31f4e><p>A recent spate of applications built on OpenAI’s GPT-4 API has the crypto community buzzing with designs toward the development of a fully-autonomous, self-correcting cryptocurrency trading bot.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">AutoGPT set to 100 runs. Goal: amalgamate best indicators for Crypto trading in Pine  code. Result looping errors. Scavenged through output, found enough bits for GPT4 to give me strategy Pine code. 4hr backtested 2018 to now. $25 to $92M. Started test today, currently $1 profit</p>— Under_the_Valley.MI (@ValleyUnder) <a href=\"https://twitter.com/ValleyUnder/status/1645759474102333440?ref_src=twsrc%5Etfw\">April 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Two such apps, dubbed “BabyAGI” and “AutoGPT,” have received particular notice, with many users attempting to build crypto trading applications on top of them. </p><p>The big idea behind both apps involves task management for GPT-4. Currently, GPT-4 excels at natural language processing, as is evidenced by the demonstrable usefulness of the ChatGPT interface, but it has no capacity for memorization.</p><p>Applications built on the GPT API are basically limited to single-session use, meaning the model can’t recall information from previous interactions. This has to do with the amount of data (referred to as the number of “tokens”) that individual queries require, as well as GPT’s tendency to hallucinate — a problem that <a href=\"https://www.vice.com/en/article/epvdme/developers-are-connecting-multiple-ai-agents-to-make-more-autonomous-ai\" target=\"_blank\" rel=\"noopener nofollow\">becomes</a> increasingly noticeable as token counts rise. </p><p>Users are, essentially, starting with a clean slate whenever they query the machine. In terms of building a crypto trading application capable of self-correction and historiographic analysis — adjusting to real-time market conditions while simultaneously keeping short and long-term trends in focus — this means even the most robust bot built on the GPT API would typically require heavy human supervision. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tech-giant-alibaba-to-roll-out-chatgpt-competitor-ai\"><strong><em>Tech giant Alibaba to roll out ChatGPT competitor AI</em></strong></a></p><p>Some clever developers may have discerned a potential method for circumventing these limitations by building applications that take advantage of GPT’s ability to generate code and connect to external sources.</p><p>We’ve seen <a href=\"https://cointelegraph.com/news/crypto-twitter-uses-new-ai-chatbot-to-make-trading-bots-blogs-and-even-songs\">our fair share of trading bots</a>, but the goal of these particular apps goes beyond simply automating crypto news aggregation or teaching a machine learning agent how to recognize the dip. </p><p><a href=\"https://github.com/Torantulino/Auto-GPT\" target=\"_blank\" rel=\"noopener nofollow\">AutoGPT</a>, for example, uses GPT-4 to generate code and then exploits GPT-3.5 to create what appears to be a virtual artificial memory space wherein information is combined and shuttled between the two. </p><p>Another effort, <a href=\"https://yoheinakajima.com/task-driven-autonomous-agent-utilizing-gpt-4-pinecone-and-langchain-for-diverse-applications/\" target=\"_blank\" rel=\"noopener nofollow\">BabyAGI</a>, combines GPT-4 with LangChain, a coding framework, and Pinecone, a vector database, to spawn new agents in order to complete complex tasks without losing focus on the original objective. </p><p>Both apps could have the potential to serve as the backbone for a multi-agent, fire-and-forget AI application capable of managing a crypto portfolio from top to bottom based on little more than plain language prompting.</p><p>While it appears neither app was specifically designed with the cryptocurrency market in mind, we’ve spotted several efforts across social media and on <a href=\"https://github.com/Torantulino/Auto-GPT/issues/498\" target=\"_blank\" rel=\"noopener nofollow\">GitHub</a> to adapt one or both for autonomous trading.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/AutoGPT?src=hash&amp;ref_src=twsrc%5Etfw\">#AutoGPT</a> using <a href=\"https://twitter.com/hashtag/GPT4?src=hash&amp;ref_src=twsrc%5Etfw\">#GPT4</a> finds another article on the Forbes website.<br>PLAN: <br>-  Browse the Forbes article<br>-  Identify the top AI crypto currencies<br>-  Add each currency to my list of top contenders<br>CRITICISM: I must ensure that I consider multiple sources and compare the information.. <a href=\"https://t.co/Lbh24eX18X\">pic.twitter.com/Lbh24eX18X</a></p>— Mr. Harrison (@Harriso20462924) <a href=\"https://twitter.com/Harriso20462924/status/1644863718121930752?ref_src=twsrc%5Etfw\">April 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>完全自律型で自己修正機能を備えた仮想通貨取引ボットの開発に向け、OpenAIのGPT-4 APIを利用した最近のアプリケーションの急増が、仮想通貨コミュニティで話題になっている。翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p>「AutoGPT」を100回実行する設定にした。目標は、Pineコードでの仮想通貨取引のための最高の指標を統合すること。しかし、ループエラーが発生した。出力をスキャンして、GPT4に十分な情報があることがわかり、Pineコードの戦略を教えてもらった。2018年から現在までの4時間バックテストで、2500万ドルから9億2000万ドルになった。今日からテストを開始し、現在1ドルの利益がある。\n\n翻訳・編集　コインテレグラフジャパン</p>— Under_the_Valley.MI (@ValleyUnder) <a href=\"https://twitter.com/ValleyUnder/status/1645759474102333440?ref_src=twsrc%5Etfw\">April 11, 2023</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<p>「BabyAGI」と「AutoGPT」という2つのアプリがあり、多くのユーザーがこれらの上に仮想通貨取引アプリを構築しようとして注目されている。翻訳・編集　コインテレグラフジャパン</p><p>GPT-4のタスク管理に関する両アプリの大きなアイデアは、自然言語処理において優れた性能を発揮するGPT-4のメモリ機能の欠如を補うことです。ChatGPTインターフェースの実用性が証明されているように、GPT-4は現在自然言語処理において優れた性能を発揮していますが、記憶力に関する機能はありません。\n\n【用語解説】\n・GPT-4：自然言語処理において優れた性能を発揮する人工知能の一種。\n・ChatGPT：GPT-4を利用した自然言語処理によるチャットボットの一種。\n・メモリ機能：情報を記憶する機能。</p><p>「GPT API」を利用したアプリケーションは、基本的には単一セッションの使用に限られます。つまり、モデルは以前のやり取りから情報を取り出すことができません。これは、個々のクエリが必要とするデータ（「トークン」の数と呼ばれる）の量と、GPTが幻覚を起こす傾向があることに関係しています。この問題は、トークン数が増えるにつれてますます顕著になります。　\n\n※GPT APIは、OpenAIが開発した人工知能のAPIです。\n\n翻訳・編集　コインテレグラフジャパン</p><p>仮想通貨取引アプリケーションを構築する場合、ユーザーはマシンにクエリを送信するたびに、実質的にクリーンスレートから始めることになります。リアルタイムの市場状況に合わせて自己修正や歴史的分析が可能な仮想通貨取引アプリケーションを構築するためには、GPT API上に構築された最も堅牢なボットでも、通常は人間の強力な監視が必要となります。つまり、短期的および長期的なトレンドを同時に把握しながら、リアルタイムの市場状況に適応することが求められます。 \n\n翻訳・編集　コインテレグラフジャパン</p><p>アリババ、ChatGPTに対抗するAIを展開へ</p><p>「GPTのコード生成能力と外部ソースへの接続能力を利用するアプリケーションを構築することで、これらの制限を回避する可能性があると、賢明な開発者たちが見出したかもしれない」という。GPTとは、OpenAIが開発した自然言語処理のためのAI技術である。スマートコントラクトの制限を回避する方法として、GPTを利用するアプリケーションが注目されている。翻訳・編集　コインテレグラフジャパン。</p><p>仮想通貨の取引ボットは数多く見てきたが、これらの特定のアプリの目的は、単に暗号資産のニュース収集を自動化することや、機械学習エージェントにディップを認識する方法を教えることを超えている。翻訳・編集　コインテレグラフジャパン</p><p>「AutoGPT」は、GPT-4を使用してコードを生成し、その後GPT-3.5を利用して、情報が結合され、両者の間でシャトルされるように見える仮想人工メモリ空間を作成します。</p><p>「BabyAGI」という新しい試みでは、GPT-4という言語モデルに、コーディングフレームワークであるLangChainと、ベクトルデータベースのPineconeを組み合わせ、新しいエージェントを生み出し、元の目的から逸れることなく複雑なタスクを完了させることを目指しています。 \n\n翻訳・編集　コインテレグラフジャパン</p><p>仮想通貨ポートフォリオをプレーンランゲージのプロンプティングに基づいてトップからボトムまで管理することができる、マルチエージェント、ファイアアンドフォーゲットAIアプリケーションのバックボーンとして機能する可能性がある両方のアプリ。</p><p>仮想通貨市場を意識して特別に設計されたわけではないようだが、私たちはソーシャルメディアやGitHub上で、自律取引に適応するための1つまたは両方のアプリを改良する試みをいくつか見つけた。翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p>「#AutoGPTが#GPT4を使用して、Forbesのウェブサイトから別の記事を見つけました。計画：- Forbesの記事を閲覧する- トップのAI仮想通貨を特定する- 各通貨を私のトップ候補リストに追加する批判：複数の情報源を考慮し、情報を比較することを確認しなければならない。 pic.twitter.com/Lbh24eX18X」\n翻訳・編集　コインテレグラフジャパン</p>— Mr. Harrison (@Harriso20462924) <a href=\"https://twitter.com/Harriso20462924/status/1644863718121930752?ref_src=twsrc%5Etfw\">April 9, 2023</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></div>"],[2957,"Wyoming defends crypto-friendly bank charter regime in Custodia Bank’s lawsuit with Fed","2023-04-11 21:37:56","https://cointelegraph.com/news/wyoming-defends-crypto-friendly-bank-charter-regime-in-custodia-bank-s-lawsuit-with-fed","The U.S. state of Wyoming has requested to intervene in the case between Custodia Bank and the Federal Reserve System, seeking to defend its framework allowing certain crypto firms to qualify as state-chartered banks.In an April 10 court filing, Wyoming Attorney General Bridget Hill filed a motion to “intervene in the defense” of the state’s regulation of Special Purpose Depository Institutions, or SPDIs. Custodia — called Avanti at the time — was the first financial institution to be approved for a bank charter under the SPDI framework, in October 2020. Custodia filed a lawsuit against the Federal Reserve and its Kansas City arm in June 2020 for delays in approving the bank’s application for a master account, which facilitates an institution’s ability to make international transfers as well as other functions. In January 2023, the Fed officially rejected the bank’s application, saying it was “inconsistent with the required factors under the law.”“The [report] the Kansas City Fed provided Custodia makes clear that its view of perceived inadequacies in Wyoming’s laws and regulations for SPDIs is partially responsible for its denial,” said the court filing. “The State of Wyoming believes that this changes the tenor of the suit and in turn questions the legitimacy and viability of the State’s statutory framework.”Though Custodia filed its lawsuit in June 2022, the Fed released a report in March in which the central bank raised concerns about Custodia “seeking to focus almost exclusively on offering products and services related to the crypto-asset sector.” Custodia spokesperson Nathan Miller told Cointelegraph at the time that the Fed’s decision was an example of “shortsightedness and inability to adapt to changing markets.“CUSTODIA STANDS FIRM IN RESPONSE TO THE FED pic.twitter.com/xXWGjffU3I— Custodia Bank ™ (@custodiabank) March 24, 2023\n\nHill pointed to the Fed’s arguments that suggested Custodia was akin to an uninsured institution “seeking to engage in multiple high risk endeavors in a high-risk industry” as part of the state of Wyoming’s concerns. The Attorney General said the Wyoming Division of Banking had issued guidance on capital requirements for the state’s SPDIs.“[The Fed has] also expressed skepticism over the aptitude of ‘new’ state-chartered banks while allowing ‘old’ state-chartered banks like BNY Mellon to engage in substantially the same digital asset custody activity Wyoming SPDIs intend to engage in,” said Hill. “A disregard of Wyoming’s right to charter depository institutions in the two-tier banking system appears, at least in part, to be the motivation for this disparate treatment and disregard of Wyoming-chartered banks.”Related: Wyoming’s private keys bill addresses growing threat to rights and assetsThe court battle could become a defining moment for how financial institutions in the United States seeking to provide crypto custody services choose to get a charter under the federal or state system. BNY Mellon launched its digital custody platform in October 2022 — the first major U.S. financial institution to do so — while the Office of the Comptroller of the Currency approved charters for Paxos, Protego, and Anchorage as national trust banks in 2021.Magazine: The legal dangers of getting involved with DAOs","<div class=\"post-content\" data-v-2ab31f4e><p>The U.S. state of Wyoming has requested to intervene in the case between Custodia Bank and the Federal Reserve System, seeking to defend its framework allowing certain crypto firms to qualify as state-chartered banks.</p><p>In an April 10 court filing, Wyoming Attorney General Bridget Hill <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.wyd.61107/gov.uscourts.wyd.61107.133.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a motion to “intervene in the defense” of the state’s regulation of Special Purpose Depository Institutions, or SPDIs. Custodia — called Avanti at the time — was the first financial institution to be <a href=\"https://cointelegraph.com/news/avanti-launches-crypto-friendly-bank-in-wyoming\">approved for a bank charter</a> under the SPDI framework, in October 2020. </p><p>Custodia <a href=\"https://cointelegraph.com/news/crypto-bank-custodia-sues-the-fed-over-19-month-delay-on-account-approval\">filed a lawsuit against the Federal Reserve</a> and its Kansas City arm in June 2020 for delays in approving the bank’s application for a master account, which facilitates an institution’s ability to make international transfers as well as other functions. In January 2023, the Fed officially <a href=\"https://cointelegraph.com/news/fed-denies-custodia-bank-application-to-join-the-federal-reserve-system\">rejected the bank’s application</a>, saying it was “inconsistent with the required factors under the law.”</p><p>“The [report] the Kansas City Fed provided Custodia makes clear that its view of perceived inadequacies in Wyoming’s laws and regulations for SPDIs is partially responsible for its denial,” said the court filing. “The State of Wyoming believes that this changes the tenor of the suit and in turn questions the legitimacy and viability of the State’s statutory framework.”</p><p>Though Custodia filed its lawsuit in June 2022, the Fed <a href=\"https://cointelegraph.com/news/custodia-bank-s-membership-denied-for-ties-with-crypto-markets-says-us-fed\">released a report</a> in March in which the central bank raised concerns about Custodia “seeking to focus almost exclusively on offering products and services related to the crypto-asset sector.” Custodia spokesperson Nathan Miller told Cointelegraph at the time that the Fed’s decision was an example of “shortsightedness and inability to adapt to changing markets.“</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CUSTODIA STANDS FIRM IN RESPONSE TO THE FED <a href=\"https://t.co/xXWGjffU3I\">pic.twitter.com/xXWGjffU3I</a></p>— Custodia Bank ™ (@custodiabank) <a href=\"https://twitter.com/custodiabank/status/1639311542104498179?ref_src=twsrc%5Etfw\">March 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Hill pointed to the Fed’s arguments that suggested Custodia was akin to an uninsured institution “seeking to engage in multiple high risk endeavors in a high-risk industry” as part of the state of Wyoming’s concerns. The Attorney General said the Wyoming Division of Banking had issued guidance on capital requirements for the state’s SPDIs.</p><p>“[The Fed has] also expressed skepticism over the aptitude of ‘new’ state-chartered banks while allowing ‘old’ state-chartered banks like BNY Mellon to engage in substantially the same digital asset custody activity Wyoming SPDIs intend to engage in,” said Hill. “A disregard of Wyoming’s right to charter depository institutions in the two-tier banking system appears, at least in part, to be the motivation for this disparate treatment and disregard of Wyoming-chartered banks.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/wyoming-s-private-keys-bill-addresses-growing-threat-to-rights-and-assets\"><strong><em>Wyoming’s private keys bill addresses growing threat to rights and assets</em></strong></a></p><p>The court battle could become a defining moment for how financial institutions in the United States seeking to provide crypto custody services choose to get a charter under the federal or state system. BNY Mellon <a href=\"https://cointelegraph.com/news/bny-mellon-america-s-oldest-bank-launches-crypto-services\">launched its digital custody platform</a> in October 2022 — the first major U.S. financial institution to do so — while the Office of the Comptroller of the Currency approved charters for Paxos, Protego, and Anchorage as national trust banks in 2021.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/legal-dangers-getting-involved-daos/\"><strong><em>The legal dangers of getting involved with DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></div>","<div class=\"post-content\" data-v-2ab31f4e=\"\"><p>ワイオミング州は、カストディア銀行と連邦準備制度の間の訴訟に介入するよう要請し、一部の仮想通貨企業が州立銀行として認定されることを可能にする同州の枠組みを擁護することを求めています。翻訳・編集　コインテレグラフジャパン</p><p>ワイオミング州の検事総長であるブリジット・ヒル氏は4月10日の法廷提出書類において、「特別目的預金機関（SPDI）の規制に関する州の防衛に介入する」という動議を提出しました。カストディア（当時はアバンティと呼ばれていました）は、2020年10月にSPDIフレームワークの下で銀行免許を取得した最初の金融機関でした。 \n\nSPDIとは、ステーブルコインの発行や仮想通貨の保管など、暗号資産に関する金融サービスを提供するために設立された銀行のことです。カストディアは、SPDIフレームワークの下で銀行免許を取得した最初の金融機関であり、暗号資産業界における重要な先駆者の一つとなっています。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「カストディア」は2020年6月、銀行のマスターアカウント申請の承認が遅れたことを理由に、連邦準備制度およびそのカンザスシティ支部に対して訴訟を起こしました。マスターアカウントは、国際送金を含む機能を提供するために、機関の能力を支援するものです。2023年1月、連邦準備制度は正式に銀行の申請を拒否し、「法律に必要な要因と矛盾している」と述べました。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「カンザスシティ連邦準備銀行がカストディアに提供した[報告書]は、ワイオミング州のSPDIに関する法律や規制の不十分さに対する同行の見解が、一部拒否の原因であることを明確にしている。」と、法廷の提出書類には記載されています。「ワイオミング州は、これによって訴訟の性格が変わり、州の法的枠組みの正当性と実効性が問われることになると考えています。」\n\n翻訳・編集 コインテレグラフジャパン</p><p>「カストディア」は2022年6月に訴訟を起こしましたが、中央銀行は3月に報告書を公表し、カストディアが「仮想通貨関連の製品やサービスにほぼ独占的に焦点を当てようとしている」と懸念を表明しました。カストディアの広報担当者であるネイサン・ミラー氏は当時、中央銀行の決定は「短絡的で、変化する市場に適応できない」と述べました。\n\n翻訳・編集　コインテレグラフジャパン</p><blockquote class=\"twitter-tweet\"><p>「CUSTODIA、FRBの発言に断固たる回答」とツイート\n\n翻訳・編集　コインテレグラフジャパン</p>— Custodia Bank ™ (@custodiabank) <a href=\"https://twitter.com/custodiabank/status/1639311542104498179?ref_src=twsrc%5Etfw\">March 24, 2023</a></blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script>\n<p>「カストディアは、高リスクの業界で複数の高リスクな取り組みに従事しようとする未保険の機関に似ている」というフェッドの主張を挙げ、ヒル氏はワイオミング州の懸念の一部として指摘しました。検事総長は、ワイオミング州銀行部門が同州のSPDIに対する資本要件に関する指導を発行したと述べました。\n\n翻訳・編集　コインテレグラフジャパン</p><p>「[連邦準備制度理事会は]『新しい』州立銀行の適性についても懐疑的な態度を示している一方で、BNYメロンのような『古い』州立銀行は、ワイオミングSPDIが行うと意図するデジタル資産の保管活動と実質的に同じ活動に従事することを許可しています」とHill氏は述べています。「二層銀行システムにおけるワイオミングの預金機関の憲章化権利を無視することは、少なくとも部分的に、この不均等な扱いとワイオミング憲章銀行の無視の動機のように見えます。」\n\n翻訳・編集 コインテレグラフジャパン</p><p>ワイオミングの秘密鍵法案は、権利と資産に対する増大する脅威に対処するものである。翻訳・編集　コインテレグラフジャパン</p><p>仲裁裁判は、仮想通貨保管サービスを提供するアメリカの金融機関が、連邦または州のシステムの下で憲章を取得する方法を選択する際の決定的な瞬間となる可能性がある。BNYメロンは2022年10月にデジタル保管プラットフォームを立ち上げ、これはアメリカの主要な金融機関として初めてのことであった。一方、Paxos、Protego、Anchorageに対しては、2021年に国立信託銀行としての憲章が米国通貨監督官庁によって承認された。\n\n【用語解説】\n・custody services：保管サービス\n・charter：憲章\n・federal：連邦の\n・state：州の\n・digital custody platform：デジタル保管プラットフォーム\n・Office of the Comptroller of the Currency：米国通貨監督官庁\n・national trust banks：国立信託銀行\n\n翻訳・編集　コインテレグラフジャパン</p><p>DAOに関与することの法的危険性\n\n仮想通貨の分野で、分散型自治組織（DAO）はますます注目を集めている。しかし、DAOに関与することには、法的なリスクがあることを知っておく必要がある。\n\nDAOは、ブロックチェーン技術を使用して、自律的に機能する組織である。これは、投票や意思決定を行うための仕組みを持ち、スマートコントラクトによって自動化されている。しかし、DAOはまだ法的には認識されておらず、法的な枠組みが整備されていないため、法的な問題が発生する可能性がある。\n\n例えば、DAOに参加することで、投資家は自分の投資を管理することができる。しかし、DAOが不正行為に関与した場合、投資家は法的な救済を求めることができない可能性がある。また、DAOが法的な義務を履行しなかった場合、投資家は法的な措置を取ることができないかもしれない。\n\nこれらの問題は、DAOが法的に認識されるようになるまで解決されない可能性がある。現在、DAOに関する法的な枠組みはまだ整備されていないため、投資家は十分な注意を払う必要がある。\n\n翻訳・編集　コインテレグラフジャパン</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></div>"]],"fields":["id","title","pubDate","link","text","html","content_translated"],"types":[23,1043,1114,1043,25,25,25],"type_names":["integer","text","timestamp without time zone","text","text","text","text"],"started_at":"2023-04-12 07:16:29 +0000","finished_at":"2023-04-12 07:16:29 +0000","checksum":"9cb9bd26afdb465f7d6e5872d6574f00"}